
*** Dumping AST Record Layout
         0 | class std::exception
         0 |   (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::type_info
         0 |   (type_info vtable pointer)
         8 |   const char * __name
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::bad_alloc
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::destroying_delete_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__exception_ptr::exception_ptr
         0 |   void * _M_exception_object
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::nested_exception
         0 |   (nested_exception vtable pointer)
         8 |   class std::__exception_ptr::exception_ptr _M_ptr
         8 |     void * _M_exception_object
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::ranges::__swap::_Swap (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::partial_ordering
         0 |   __cmp_cat::type _M_value
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::weak_ordering
         0 |   __cmp_cat::type _M_value
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::strong_ordering
         0 |   __cmp_cat::type _M_value
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__cmp_cat::__unspec (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::compare_three_way (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__compare::_Strong_order::_Int<short>
         0 |   uint64_t _M_lo
         8 |   short _M_hi
           | [sizeof=16, dsize=10, align=8,
           |  nvsize=10, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compare::_Strong_order::_Int<int>
         0 |   uint64_t _M_lo
         8 |   int _M_hi
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compare::_Strong_order::_Int<long>
         0 |   uint64_t _M_lo
         8 |   long _M_hi
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__compare::_Strong_order (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__compare::_Weak_order (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__compare::_Partial_order (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__compare::_Strong_fallback (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__compare::_Weak_fallback (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__compare::_Partial_fallback (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__detail::_Synth3way (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::default_sentinel_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__imove::_IterMove (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__iswap::_IterSwap (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::unreachable_sentinel_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_Decay_copy (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __locale_struct
         0 |   struct __locale_data *[13] __locales
       104 |   const unsigned short * __ctype_b
       112 |   const int * __ctype_tolower
       120 |   const int * __ctype_toupper
       128 |   const char *[13] __names
           | [sizeof=232, dsize=232, align=8,
           |  nvsize=232, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __va_list_tag
         0 |   unsigned int gp_offset
         4 |   unsigned int fp_offset
         8 |   void * overflow_arg_area
        16 |   void * reg_save_area
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __cancel_jmp_buf_tag
         0 |   __jmp_buf __cancel_jmp_buf
        64 |   int __mask_was_saved
           | [sizeof=72, dsize=72, align=8,
           |  nvsize=72, nvalign=8]

*** Dumping AST Record Layout
         0 | __sigset_t
         0 |   unsigned long[16] __val
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __jmp_buf_tag
         0 |   __jmp_buf __jmpbuf
        64 |   int __mask_was_saved
        72 |   __sigset_t __saved_mask
        72 |     unsigned long[16] __val
           | [sizeof=200, dsize=200, align=8,
           |  nvsize=200, nvalign=8]

*** Dumping AST Record Layout
         0 | union pthread_attr_t
         0 |   char[56] __size
         0 |   long __align
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_internal_list
         0 |   struct __pthread_internal_list * __prev
         8 |   struct __pthread_internal_list * __next
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_mutex_s
         0 |   int __lock
         4 |   unsigned int __count
         8 |   int __owner
        12 |   unsigned int __nusers
        16 |   int __kind
        20 |   short __spins
        22 |   short __elision
        24 |   struct __pthread_internal_list __list
        24 |     struct __pthread_internal_list * __prev
        32 |     struct __pthread_internal_list * __next
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | pthread_mutex_t
         0 |   struct __pthread_mutex_s __data
         0 |     int __lock
         4 |     unsigned int __count
         8 |     int __owner
        12 |     unsigned int __nusers
        16 |     int __kind
        20 |     short __spins
        22 |     short __elision
        24 |     struct __pthread_internal_list __list
        24 |       struct __pthread_internal_list * __prev
        32 |       struct __pthread_internal_list * __next
         0 |   char[40] __size
         0 |   long __align
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | pthread_mutexattr_t
         0 |   char[4] __size
         0 |   int __align
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __time_t tv_sec
         8 |   __syscall_slong_t tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __atomic_wide_counter::(unnamed at /usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h:28:3)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | __atomic_wide_counter
         0 |   unsigned long long __value64
         0 |   struct __atomic_wide_counter::(unnamed at /usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h:28:3) __value32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s
         0 |   __atomic_wide_counter __wseq
         0 |     unsigned long long __value64
         0 |     struct __atomic_wide_counter::(unnamed at /usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h:28:3) __value32
         0 |       unsigned int __low
         4 |       unsigned int __high
         8 |   __atomic_wide_counter __g1_start
         8 |     unsigned long long __value64
         8 |     struct __atomic_wide_counter::(unnamed at /usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h:28:3) __value32
         8 |       unsigned int __low
        12 |       unsigned int __high
        16 |   unsigned int[2] __g_size
        24 |   unsigned int __g1_orig_size
        28 |   unsigned int __wrefs
        32 |   unsigned int[2] __g_signals
        40 |   unsigned int __unused_initialized_1
        44 |   unsigned int __unused_initialized_2
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | pthread_cond_t
         0 |   struct __pthread_cond_s __data
         0 |     __atomic_wide_counter __wseq
         0 |       unsigned long long __value64
         0 |       struct __atomic_wide_counter::(unnamed at /usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h:28:3) __value32
         0 |         unsigned int __low
         4 |         unsigned int __high
         8 |     __atomic_wide_counter __g1_start
         8 |       unsigned long long __value64
         8 |       struct __atomic_wide_counter::(unnamed at /usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h:28:3) __value32
         8 |         unsigned int __low
        12 |         unsigned int __high
        16 |     unsigned int[2] __g_size
        24 |     unsigned int __g1_orig_size
        28 |     unsigned int __wrefs
        32 |     unsigned int[2] __g_signals
        40 |     unsigned int __unused_initialized_1
        44 |     unsigned int __unused_initialized_2
         0 |   char[48] __size
         0 |   long long __align
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::binary_function<const volatile void *, const volatile void *, _Bool> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::greater<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::less<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::greater_equal<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::less_equal<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::in_place_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::_Swallow_assign (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_less_iter (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_less_val (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Val_less_iter (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_equal_to_iter (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_equal_to_val (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<void> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::ranges::__detail::__max_size_type
         0 |   __rep _M_val
    16:0-0 |   unsigned int _M_msb
           | [sizeof=32, dsize=17, align=16,
           |  nvsize=17, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::ranges::__detail::__max_diff_type
         0 |   class std::ranges::__detail::__max_size_type _M_rep
         0 |     __rep _M_val
    16:0-0 |     unsigned int _M_msb
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_Begin (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_End (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_RBegin (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_REnd (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_Size (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_SSize (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_Empty (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_Data (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_CBegin (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_CEnd (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_CRBegin (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_CREnd (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__access::_CData (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__advance_fn (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__distance_fn (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__next_fn (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__prev_fn (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::basic_string_view<char>
         0 |   size_t _M_len
         8 |   const char * _M_str
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string_view<wchar_t>
         0 |   size_t _M_len
         8 |   const wchar_t * _M_str
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string_view<char8_t>
         0 |   size_t _M_len
         8 |   const char8_t * _M_str
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string_view<char16_t>
         0 |   size_t _M_len
         8 |   const char16_t * _M_str
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string_view<char32_t>
         0 |   size_t _M_len
         8 |   const char32_t * _M_str
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::input_iterator_tag (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::forward_iterator_tag (empty)
         0 |   struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__false_type (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | lldiv_t
         0 |   long long quot
         8 |   long long rem
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__new_allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char> (empty)
         0 |   class std::__new_allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char>::_Alloc_hider
         0 |   class std::allocator<char> (base) (empty)
         0 |     class std::__new_allocator<char> (base) (empty)
         0 |   pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char>::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_string.h:220:7)
         0 |   char[16] _M_local_buf
         0 |   size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<char>
         0 |   struct std::basic_string<char>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<char> (base) (empty)
         0 |       class std::__new_allocator<char> (base) (empty)
         0 |     pointer _M_p
         8 |   size_type _M_string_length
        16 |   union std::basic_string<char>::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_string.h:220:7) 
        16 |     char[16] _M_local_buf
        16 |     size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::integral_constant<_Bool, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<class std::allocator<char> > (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__new_allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<wchar_t> (empty)
         0 |   class std::__new_allocator<wchar_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<wchar_t>::_Alloc_hider
         0 |   class std::allocator<wchar_t> (base) (empty)
         0 |     class std::__new_allocator<wchar_t> (base) (empty)
         0 |   pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<wchar_t>::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_string.h:220:7)
         0 |   wchar_t[4] _M_local_buf
         0 |   size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<wchar_t>
         0 |   struct std::basic_string<wchar_t>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<wchar_t> (base) (empty)
         0 |       class std::__new_allocator<wchar_t> (base) (empty)
         0 |     pointer _M_p
         8 |   size_type _M_string_length
        16 |   union std::basic_string<wchar_t>::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_string.h:220:7) 
        16 |     wchar_t[4] _M_local_buf
        16 |     size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::bidirectional_iterator_tag (empty)
         0 |   struct std::forward_iterator_tag (base) (empty)
         0 |     struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::random_access_iterator_tag (empty)
         0 |   struct std::bidirectional_iterator_tag (base) (empty)
         0 |     struct std::forward_iterator_tag (base) (empty)
         0 |       struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<class std::allocator<wchar_t> > (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__new_allocator<char8_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char8_t> (empty)
         0 |   class std::__new_allocator<char8_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char8_t>::_Alloc_hider
         0 |   class std::allocator<char8_t> (base) (empty)
         0 |     class std::__new_allocator<char8_t> (base) (empty)
         0 |   pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char8_t>::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_string.h:220:7)
         0 |   char8_t[16] _M_local_buf
         0 |   size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<char8_t>
         0 |   struct std::basic_string<char8_t>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<char8_t> (base) (empty)
         0 |       class std::__new_allocator<char8_t> (base) (empty)
         0 |     pointer _M_p
         8 |   size_type _M_string_length
        16 |   union std::basic_string<char8_t>::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_string.h:220:7) 
        16 |     char8_t[16] _M_local_buf
        16 |     size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__new_allocator<char16_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char16_t> (empty)
         0 |   class std::__new_allocator<char16_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char16_t>::_Alloc_hider
         0 |   class std::allocator<char16_t> (base) (empty)
         0 |     class std::__new_allocator<char16_t> (base) (empty)
         0 |   pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char16_t>::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_string.h:220:7)
         0 |   char16_t[8] _M_local_buf
         0 |   size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<char16_t>
         0 |   struct std::basic_string<char16_t>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<char16_t> (base) (empty)
         0 |       class std::__new_allocator<char16_t> (base) (empty)
         0 |     pointer _M_p
         8 |   size_type _M_string_length
        16 |   union std::basic_string<char16_t>::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_string.h:220:7) 
        16 |     char16_t[8] _M_local_buf
        16 |     size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__new_allocator<char32_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char32_t> (empty)
         0 |   class std::__new_allocator<char32_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char32_t>::_Alloc_hider
         0 |   class std::allocator<char32_t> (base) (empty)
         0 |     class std::__new_allocator<char32_t> (base) (empty)
         0 |   pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char32_t>::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_string.h:220:7)
         0 |   char32_t[4] _M_local_buf
         0 |   size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<char32_t>
         0 |   struct std::basic_string<char32_t>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<char32_t> (base) (empty)
         0 |       class std::__new_allocator<char32_t> (base) (empty)
         0 |     pointer _M_p
         8 |   size_type _M_string_length
        16 |   union std::basic_string<char32_t>::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_string.h:220:7) 
        16 |     char32_t[4] _M_local_buf
        16 |     size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__find_fn (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__find_if_fn (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__find_if_not_fn (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__mismatch_fn (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__search_fn (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__min_fn (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ranges::__adjacent_find_fn (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | max_align_t
         0 |   long long __clang_max_align_nonce1
        16 |   long double __clang_max_align_nonce2
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::pmr::memory_resource
         0 |   (memory_resource vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale
         0 |   _Impl * _M_impl
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::facet
         0 |   (facet vtable pointer)
         8 |   _Atomic_word _M_refcount
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::_Impl
         0 |   _Atomic_word _M_refcount
         8 |   const facet ** _M_facets
        16 |   size_t _M_facets_size
        24 |   const facet ** _M_caches
        32 |   char ** _M_names
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::id
         0 |   size_t _M_index
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::error_code
         0 |   int _M_value
         8 |   const error_category * _M_cat
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::error_category
         0 |   (error_category vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::error_condition
         0 |   int _M_value
         8 |   const error_category * _M_cat
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__cow_string::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/stdexcept:52:5)
         0 |   const char * _M_p
         0 |   char[8] _M_bytes
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__cow_string
         0 |   union std::__cow_string::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/stdexcept:52:5) 
         0 |     const char * _M_p
         0 |     char[8] _M_bytes
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::runtime_error
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
         8 |   struct std::__cow_string _M_msg
         8 |     union std::__cow_string::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/stdexcept:52:5) 
         8 |       const char * _M_p
         8 |       char[8] _M_bytes
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::system_error
         0 |   class std::runtime_error (primary base)
         0 |     class std::exception (primary base)
         0 |       (exception vtable pointer)
         8 |     struct std::__cow_string _M_msg
         8 |       union std::__cow_string::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/stdexcept:52:5) 
         8 |         const char * _M_p
         8 |         char[8] _M_bytes
        16 |   class std::error_code _M_code
        16 |     int _M_value
        24 |     const error_category * _M_cat
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::ios_base::_Words
         0 |   void * _M_pword
         8 |   long _M_iword
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::ios_base
         0 |   (ios_base vtable pointer)
         8 |   streamsize _M_precision
        16 |   streamsize _M_width
        24 |   fmtflags _M_flags
        28 |   iostate _M_exception
        32 |   iostate _M_streambuf_state
        40 |   _Callback_list * _M_callbacks
        48 |   struct std::ios_base::_Words _M_word_zero
        48 |     void * _M_pword
        56 |     long _M_iword
        64 |   _Words[8] _M_local_word
       192 |   int _M_word_size
       200 |   _Words * _M_word
       208 |   class std::locale _M_ios_locale
       208 |     _Impl * _M_impl
           | [sizeof=216, dsize=216, align=8,
           |  nvsize=216, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<class std::locale> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ctype_base (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::ctype<char>
         0 |   class std::locale::facet (primary base)
         0 |     (facet vtable pointer)
         8 |     _Atomic_word _M_refcount
         0 |   struct std::ctype_base (base) (empty)
        16 |   __c_locale _M_c_locale_ctype
        24 |   _Bool _M_del
        32 |   __to_type _M_toupper
        40 |   __to_type _M_tolower
        48 |   const mask * _M_table
        56 |   char _M_widen_ok
        57 |   char[256] _M_widen
       313 |   char[256] _M_narrow
       569 |   char _M_narrow_ok
           | [sizeof=576, dsize=570, align=8,
           |  nvsize=570, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<_Bool> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ios_base::_Callback_list
         0 |   _Callback_list * _M_next
         8 |   class ios_base::event_callback _M_fn
        16 |   int _M_index
        20 |   _Atomic_word _M_refcount
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::basic_ios<char>
         0 |   class std::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     streamsize _M_precision
        16 |     streamsize _M_width
        24 |     fmtflags _M_flags
        28 |     iostate _M_exception
        32 |     iostate _M_streambuf_state
        40 |     _Callback_list * _M_callbacks
        48 |     struct std::ios_base::_Words _M_word_zero
        48 |       void * _M_pword
        56 |       long _M_iword
        64 |     _Words[8] _M_local_word
       192 |     int _M_word_size
       200 |     _Words * _M_word
       208 |     class std::locale _M_ios_locale
       208 |       _Impl * _M_impl
       216 |   basic_ostream<char, char_traits<char> > * _M_tie
       224 |   char_type _M_fill
       225 |   _Bool _M_fill_init
       232 |   basic_streambuf<char, char_traits<char> > * _M_streambuf
       240 |   const __ctype_type * _M_ctype
       248 |   const __num_put_type * _M_num_put
       256 |   const __num_get_type * _M_num_get
           | [sizeof=264, dsize=264, align=8,
           |  nvsize=264, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::basic_ios<char> (virtual base)
         8 |     class std::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       streamsize _M_precision
        24 |       streamsize _M_width
        32 |       fmtflags _M_flags
        36 |       iostate _M_exception
        40 |       iostate _M_streambuf_state
        48 |       _Callback_list * _M_callbacks
        56 |       struct std::ios_base::_Words _M_word_zero
        56 |         void * _M_pword
        64 |         long _M_iword
        72 |       _Words[8] _M_local_word
       200 |       int _M_word_size
       208 |       _Words * _M_word
       216 |       class std::locale _M_ios_locale
       216 |         _Impl * _M_impl
       224 |     basic_ostream<char, char_traits<char> > * _M_tie
       232 |     char_type _M_fill
       233 |     _Bool _M_fill_init
       240 |     basic_streambuf<char, char_traits<char> > * _M_streambuf
       248 |     const __ctype_type * _M_ctype
       256 |     const __num_put_type * _M_num_put
       264 |     const __num_get_type * _M_num_get
           | [sizeof=272, dsize=272, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class DictionaryEntry<class std::basic_string<char>, int>
         0 |   class std::basic_string<char> key_
         0 |     struct std::basic_string<char>::_Alloc_hider _M_dataplus
         0 |       class std::allocator<char> (base) (empty)
         0 |         class std::__new_allocator<char> (base) (empty)
         0 |       pointer _M_p
         8 |     size_type _M_string_length
        16 |     union std::basic_string<char>::(anonymous at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_string.h:220:7) 
        16 |       char[16] _M_local_buf
        16 |       size_type _M_allocated_capacity
        32 |   int value_
           | [sizeof=40, dsize=36, align=8,
           |  nvsize=36, nvalign=8]

*** Dumping AST Record Layout
         0 | class FixedDictionary<class std::basic_string<char>, int, 3>
         0 |   DictionaryEntry<basic_string<char, char_traits<char>, allocator<char> >, int>[3] entries_
       120 |   std::size_t currentSize_
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _Guard
         0 |   basic_string<char> * _M_guarded
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<const char *> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class DictionaryEntry<const char *, int>
         0 |   const char * key_
         8 |   int value_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class FixedDictionary<const char *, int, 3>
         0 |   DictionaryEntry<const char *, int>[3] entries_
        48 |   std::size_t currentSize_
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cae84238[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ios_base.h:636:5[0m, [0;33mline:641:5[0m> [0;33mline:636:12[0m referenced struct[0;1;36m _Words[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided defaulted_is_constexpr
[0;34m| |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists simple trivial
[0;34m| |-[0m[0;1;32mCopyAssignment[0m simple trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists simple trivial
[0;34m| `-[0m[0;1;32mDestructor[0m simple irrelevant trivial constexpr
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cae84370[0m <[0;33mcol:5[0m, [0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced struct[0;1;36m _Words[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae84438[0m <[0;33mline:638:7[0m, [0;33mcol:13[0m> [0;33mcol:13[0m referenced[0;1;36m _M_pword[0m [0;32m'void *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae844a8[0m <[0;33mline:639:7[0m, [0;33mcol:12[0m> [0;33mcol:12[0m referenced[0;1;36m _M_iword[0m [0;32m'long'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae84570[0m <[0;33mline:640:7[0m, [0;33mcol:45[0m> [0;33mcol:7[0m referenced[0;1;36m _Words[0m [0;32m'void ()'[0m implicit-inline
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x57e0cae84438[0m[0;1;36m '_M_pword'[0m [0;32m'void *'[0m
[0;34m| | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae89db8[0m <[0;33mcol:27[0m> [0;32m'void *'[0m[0;36m[0m[0;36m[0m <[0;31mNullToPointer[0m>
[0;34m| |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cae89d78[0m <[0;33mcol:27[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x57e0cae844a8[0m[0;1;36m '_M_iword'[0m [0;32m'long'[0m
[0;34m| | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae89e30[0m <[0;33mcol:40[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m| |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cae89df0[0m <[0;33mcol:40[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae89e78[0m <[0;33mcol:43[0m, [0;33mcol:45[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae88578[0m <[0;33mline:636:12[0m> [0;33mcol:12[0m implicit constexpr[0;1;36m _Words[0m [0;32m'void (const _Words &)'[0m inline default trivial noexcept-unevaluated 0x57e0cae88578
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae886b8[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'const _Words &'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae887a8[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit constexpr[0;1;36m _Words[0m [0;32m'void (_Words &&)'[0m inline default trivial noexcept-unevaluated 0x57e0cae887a8
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae888e8[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'_Words &&'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae88970[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit[0;1;36m operator=[0m [0;32m'_Words &(const _Words &)'[0m inline default trivial noexcept-unevaluated 0x57e0cae88970
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae88aa8[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'const _Words &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae88b20[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit[0;1;36m operator=[0m [0;32m'_Words &(_Words &&)'[0m inline default trivial noexcept-unevaluated 0x57e0cae88b20
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae88c58[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'_Words &&'[0m
[0;34m`-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x57e0cb011cb0[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced constexpr[0;1;36m ~_Words[0m [0;32m'void () noexcept'[0m inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::ios_base::_Words" = type { ptr, i64 }
  NonVirtualBaseLLVMType:%"struct.std::ios_base::_Words" = type { ptr, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cad9d8c8[0m prev 0x57e0c9ffae58 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:68:3[0m, [0;33mline:384:3[0m> [0;33mline:68:9[0m referenced class[0;1;36m locale[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m standard_layout has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided defaulted_is_constexpr
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cad9d9c8[0m <[0;33mcol:3[0m, [0;33mcol:9[0m> [0;33mcol:9[0m implicit referenced class[0;1;36m locale[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cad9da78[0m <[0;33mline:70:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cad9dac0[0m <[0;33mline:73:5[0m, [0;33mcol:17[0m> [0;33mcol:17[0m referenced[0;1;36m category[0m [0;32m'int'[0m
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad58c0[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cad9db20[0m <[0;33mline:76:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m referenced class[0;1;36m facet[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cad9dbf8[0m <[0;33mline:77:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m referenced class[0;1;36m id[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cad9dcc8[0m <[0;33mline:78:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m referenced class[0;1;36m _Impl[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x57e0cad9dde8[0m <[0;33mline:80:5[0m, [0;33mcol:18[0m> [0;33mcol:12[0m [0;32m'class facet':'std::locale::facet'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x57e0cad9de88[0m <[0;33mline:81:5[0m, [0;33mcol:18[0m> [0;33mcol:12[0m [0;32m'class _Impl':'std::locale::_Impl'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x57e0cad9e270[0m <[0;33mline:83:5[0m, [0;33mline:85:38[0m> [0;33mcol:7[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x57e0cad9e190[0m parent 0x57e0cad9d7f8 prev 0x57e0c9ffb260 <[0;33mline:83:5[0m, [0;33mline:85:38[0m> [0;33mcol:7[0m friend[0;1;36m has_facet[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0cad9ded8[0m <[0;33mline:83:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0cad9e0d0[0m parent 0x57e0cad9d7f8 prev 0x57e0c9ffb1b0 <[0;33mline:84:7[0m, [0;33mline:85:38[0m> [0;33mcol:7[0m friend[0;1;36m has_facet[0m [0;32m'bool (const locale &) throw()'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cad9dfa0[0m <[0;33mcol:17[0m, [0;33mcol:29[0m> [0;33mcol:30[0m [0;32m'const locale &'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0cade2a18[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) noexcept'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0cadec570[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) noexcept'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0cafde160[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) noexcept'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0cafde610[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) noexcept'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0cafdec20[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) noexcept'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0cafdf230[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) noexcept'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0caff2dc0[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) noexcept'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0caff3270[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) noexcept'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0caff3880[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) noexcept'[0m
[0;34m|   `-[0m[0;1;32mFunction[0m[0;33m 0x57e0caff3e90[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) noexcept'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x57e0cad9e638[0m <[0;33mline:87:5[0m, [0;33mline:89:30[0m> [0;33mcol:7[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x57e0cad9e558[0m parent 0x57e0cad9d7f8 prev 0x57e0c9ffb618 <[0;33mline:87:5[0m, [0;33mline:89:30[0m> [0;33mcol:7[0m friend[0;1;36m use_facet[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0cad9e2c0[0m <[0;33mline:87:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m referenced typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0cad9e498[0m parent 0x57e0cad9d7f8 prev 0x57e0c9ffb568 <[0;33mline:88:7[0m, [0;33mline:89:30[0m> [0;33mcol:7[0m friend[0;1;36m use_facet[0m [0;32m'const _Facet &(const locale &)'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cad9e380[0m <[0;33mcol:17[0m, [0;33mcol:29[0m> [0;33mcol:30[0m [0;32m'const locale &'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0cade2518[0m[0;1;36m 'use_facet'[0m [0;32m'const std::collate<char> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0cadec0c8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::collate<wchar_t> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0cafdc0e8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::ctype<char> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0cafdc858[0m[0;1;36m 'use_facet'[0m [0;32m'const std::numpunct<char> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0cafdd288[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_put<char> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0cafddcb8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_get<char> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0caff0d48[0m[0;1;36m 'use_facet'[0m [0;32m'const std::ctype<wchar_t> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0caff14b8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::numpunct<wchar_t> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x57e0caff1ee8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_put<wchar_t> &(const locale &)'[0m
[0;34m|   `-[0m[0;1;32mFunction[0m[0;33m 0x57e0caff2918[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_get<wchar_t> &(const locale &)'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x57e0cad9ea00[0m <[0;33mline:91:5[0m, [0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:246:33[0m> [0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:93:7[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x57e0cad9e970[0m parent 0x57e0cad9d7f8 <[0;33mline:91:5[0m, [0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:246:33[0m> [0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:93:7[0m friend_undeclared[0;1;36m __try_use_facet[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0cad9e688[0m <[0;33mline:91:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m referenced typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0cad9e8b0[0m parent 0x57e0cad9d7f8 <[0;33mline:92:7[0m, [0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:246:33[0m> [0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:93:7[0m friend_undeclared[0;1;36m __try_use_facet[0m [0;32m'const _Facet *(const locale &) noexcept'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cad9e750[0m <[0;33mcol:23[0m, [0;33mcol:35[0m> [0;33mcol:36[0m [0;32m'const locale &'[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0cade1de0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.tcc:116:5[0m, [0;33mline:172:5[0m> [0;33mline:117:5[0m[0;1;36m __try_use_facet[0m [0;32m'const std::collate<char> *(const locale &) noexcept'[0m explicit_instantiation_declaration inline
[0;34m|   | |-[0mTemplateArgument type 'std::collate<char>'
[0;34m|   | | `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadc0b90[0m [0;32m'std::collate<char>'[0m
[0;34m|   | |   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadc0a98[0m[0;1;36m 'collate'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cade1d08[0m <[0;33mcol:21[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0cadeb9b0[0m <[0;33mline:116:5[0m, [0;33mline:172:5[0m> [0;33mline:117:5[0m[0;1;36m __try_use_facet[0m [0;32m'const std::collate<wchar_t> *(const locale &) noexcept'[0m explicit_instantiation_declaration inline
[0;34m|   | |-[0mTemplateArgument type 'std::collate<wchar_t>'
[0;34m|   | | `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadc3ce0[0m [0;32m'std::collate<wchar_t>'[0m
[0;34m|   | |   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadc3be8[0m[0;1;36m 'collate'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cadeb8d8[0m <[0;33mcol:21[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0cafd9e60[0m <[0;33mline:116:5[0m, [0;33mline:172:5[0m> [0;33mline:117:5[0m[0;1;36m __try_use_facet[0m [0;32m'const std::ctype<char> *(const locale &) noexcept'[0m explicit_instantiation_declaration inline
[0;34m|   | |-[0mTemplateArgument type 'std::ctype<char>'
[0;34m|   | | `-[0m[0;32mRecordType[0m[0;33m 0x57e0ca0004c0[0m [0;32m'std::ctype<char>'[0m
[0;34m|   | |   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0caf22080[0m[0;1;36m 'ctype'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cafd9d88[0m <[0;33mcol:21[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0cafda5b0[0m <[0;33mline:116:5[0m, [0;33mline:172:5[0m> [0;33mline:117:5[0m[0;1;36m __try_use_facet[0m [0;32m'const std::numpunct<char> *(const locale &) noexcept'[0m explicit_instantiation_declaration inline
[0;34m|   | |-[0mTemplateArgument type 'std::numpunct<char>'
[0;34m|   | | `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadd3960[0m [0;32m'std::numpunct<char>'[0m
[0;34m|   | |   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadd3870[0m[0;1;36m 'numpunct'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cafda4d8[0m <[0;33mcol:21[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0cafdafc0[0m <[0;33mline:116:5[0m, [0;33mline:172:5[0m> [0;33mline:117:5[0m[0;1;36m __try_use_facet[0m [0;32m'const std::num_put<char> *(const locale &) noexcept'[0m explicit_instantiation_declaration inline
[0;34m|   | |-[0mTemplateArgument type 'std::num_put<char>'
[0;34m|   | | `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadcc7f0[0m [0;32m'std::num_put<char>'[0m
[0;34m|   | |   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadcc6e8[0m[0;1;36m 'num_put'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cafdaee8[0m <[0;33mcol:21[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0cafdb9d0[0m <[0;33mline:116:5[0m, [0;33mline:172:5[0m> [0;33mline:117:5[0m[0;1;36m __try_use_facet[0m [0;32m'const std::num_get<char> *(const locale &) noexcept'[0m explicit_instantiation_declaration inline
[0;34m|   | |-[0mTemplateArgument type 'std::num_get<char>'
[0;34m|   | | `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadcc220[0m [0;32m'std::num_get<char>'[0m
[0;34m|   | |   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadcc118[0m[0;1;36m 'num_get'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cafdb8f8[0m <[0;33mcol:21[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0cafeeac0[0m <[0;33mline:116:5[0m, [0;33mline:172:5[0m> [0;33mline:117:5[0m[0;1;36m __try_use_facet[0m [0;32m'const std::ctype<wchar_t> *(const locale &) noexcept'[0m explicit_instantiation_declaration inline
[0;34m|   | |-[0mTemplateArgument type 'std::ctype<wchar_t>'
[0;34m|   | | `-[0m[0;32mRecordType[0m[0;33m 0x57e0ca000660[0m [0;32m'std::ctype<wchar_t>'[0m
[0;34m|   | |   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0caf2d468[0m[0;1;36m 'ctype'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cafee9e8[0m <[0;33mcol:21[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0cafef210[0m <[0;33mline:116:5[0m, [0;33mline:172:5[0m> [0;33mline:117:5[0m[0;1;36m __try_use_facet[0m [0;32m'const std::numpunct<wchar_t> *(const locale &) noexcept'[0m explicit_instantiation_declaration inline
[0;34m|   | |-[0mTemplateArgument type 'std::numpunct<wchar_t>'
[0;34m|   | | `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadd6b50[0m [0;32m'std::numpunct<wchar_t>'[0m
[0;34m|   | |   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadd6a60[0m[0;1;36m 'numpunct'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cafef138[0m <[0;33mcol:21[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0cafefc20[0m <[0;33mline:116:5[0m, [0;33mline:172:5[0m> [0;33mline:117:5[0m[0;1;36m __try_use_facet[0m [0;32m'const std::num_put<wchar_t> *(const locale &) noexcept'[0m explicit_instantiation_declaration inline
[0;34m|   | |-[0mTemplateArgument type 'std::num_put<wchar_t>'
[0;34m|   | | `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadd5370[0m [0;32m'std::num_put<wchar_t>'[0m
[0;34m|   | |   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadd5268[0m[0;1;36m 'num_put'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cafefb48[0m <[0;33mcol:21[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|   `-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0caff0630[0m <[0;33mline:116:5[0m, [0;33mline:172:5[0m> [0;33mline:117:5[0m[0;1;36m __try_use_facet[0m [0;32m'const std::num_get<wchar_t> *(const locale &) noexcept'[0m explicit_instantiation_declaration inline
[0;34m|     |-[0mTemplateArgument type 'std::num_get<wchar_t>'
[0;34m|     | `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadd4da0[0m [0;32m'std::num_get<wchar_t>'[0m
[0;34m|     |   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadd4c98[0m[0;1;36m 'num_get'[0m
[0;34m|     `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0caff0558[0m <[0;33mcol:21[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x57e0cad9ee18[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:95:5[0m, [0;33mline:96:21[0m> [0;33mcol:21[0m
[0;34m| `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0cad9eba8[0m parent 0x57e0cad9d7f8 <[0;33mline:95:5[0m, [0;33mline:96:21[0m> [0;33mcol:21[0m friend_undeclared[0;1;36m __use_cache[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0cad9ea50[0m <[0;33mline:95:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m typename depth 0 index 0[0;1;36m _Cache[0m
[0;34m|   `-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cad9eaf8[0m parent 0x57e0cad9d7f8 <[0;33mline:96:14[0m, [0;33mcol:21[0m> [0;33mcol:21[0m struct[0;1;36m __use_cache[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cad9eef8[0m <[0;33mline:108:5[0m, [0;33mcol:35[0m> [0;33mcol:27[0m[0;1;36m none[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cad9ef60[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cada0ca8[0m <[0;33mline:109:5[0m, [0;33mcol:42[0m> [0;33mcol:27[0m referenced[0;1;36m ctype[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada0d88[0m <[0;33mcol:36[0m, [0;33mcol:42[0m> [0;32m'const category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cada0d50[0m <[0;33mcol:36[0m, [0;33mcol:42[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada0d10[0m <[0;33mcol:36[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada0d30[0m <[0;33mcol:42[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cada0e00[0m <[0;33mline:110:5[0m, [0;33mcol:43[0m> [0;33mcol:27[0m referenced[0;1;36m numeric[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada0ee0[0m <[0;33mcol:37[0m, [0;33mcol:43[0m> [0;32m'const category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cada0ea8[0m <[0;33mcol:37[0m, [0;33mcol:43[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada0e68[0m <[0;33mcol:37[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada0e88[0m <[0;33mcol:43[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cada0f58[0m <[0;33mline:111:5[0m, [0;33mcol:43[0m> [0;33mcol:27[0m referenced[0;1;36m collate[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada1038[0m <[0;33mcol:37[0m, [0;33mcol:43[0m> [0;32m'const category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cada1000[0m <[0;33mcol:37[0m, [0;33mcol:43[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada0fc0[0m <[0;33mcol:37[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada0fe0[0m <[0;33mcol:43[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 2[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cada10b0[0m <[0;33mline:112:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m time[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada1190[0m <[0;33mcol:35[0m, [0;33mcol:41[0m> [0;32m'const category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cada1158[0m <[0;33mcol:35[0m, [0;33mcol:41[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada1118[0m <[0;33mcol:35[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada1138[0m <[0;33mcol:41[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 3[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cada1208[0m <[0;33mline:113:5[0m, [0;33mcol:44[0m> [0;33mcol:27[0m referenced[0;1;36m monetary[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada12e8[0m <[0;33mcol:38[0m, [0;33mcol:44[0m> [0;32m'const category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cada12b0[0m <[0;33mcol:38[0m, [0;33mcol:44[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada1270[0m <[0;33mcol:38[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada1290[0m <[0;33mcol:44[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 4[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cada1360[0m <[0;33mline:114:5[0m, [0;33mcol:44[0m> [0;33mcol:27[0m referenced[0;1;36m messages[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada1440[0m <[0;33mcol:38[0m, [0;33mcol:44[0m> [0;32m'const category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cada1408[0m <[0;33mcol:38[0m, [0;33mcol:44[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada13c8[0m <[0;33mcol:38[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada13e8[0m <[0;33mcol:44[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 5[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cada14b8[0m <[0;33mline:115:5[0m, [0;33mline:116:36[0m> [0;33mline:115:27[0m[0;1;36m all[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mParenExpr[0m[0;33m 0x57e0cada1818[0m <[0;33mcol:34[0m, [0;33mline:116:36[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cada17f8[0m <[0;33mline:115:35[0m, [0;33mline:116:28[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cada1780[0m <[0;33mline:115:35[0m, [0;33mline:116:17[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cada1708[0m <[0;33mline:115:35[0m, [0;33mline:116:9[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     | | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cada1690[0m <[0;33mline:115:35[0m, [0;33mcol:53[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     | | | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cada1618[0m <[0;33mcol:35[0m, [0;33mcol:43[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     | | | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada15c8[0m <[0;33mcol:35[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | | | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cada15a8[0m <[0;33mcol:35[0m> [0;32m'const category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cada0ca8[0m[0;1;36m 'ctype'[0m [0;32m'const category':'const int'[0m non_odr_use_constant
[0;34m|     | | | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada1600[0m <[0;33mcol:43[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | | | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cada15e0[0m <[0;33mcol:43[0m> [0;32m'const category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cada0e00[0m[0;1;36m 'numeric'[0m [0;32m'const category':'const int'[0m non_odr_use_constant
[0;34m|     | | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada1678[0m <[0;33mcol:53[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cada1658[0m <[0;33mcol:53[0m> [0;32m'const category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cada0f58[0m[0;1;36m 'collate'[0m [0;32m'const category':'const int'[0m non_odr_use_constant
[0;34m|     | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada16f0[0m <[0;33mline:116:9[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cada16d0[0m <[0;33mcol:9[0m> [0;32m'const category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cada10b0[0m[0;1;36m 'time'[0m [0;32m'const category':'const int'[0m non_odr_use_constant
[0;34m|     | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada1768[0m <[0;33mcol:17[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cada1748[0m <[0;33mcol:17[0m> [0;32m'const category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cada1208[0m[0;1;36m 'monetary'[0m [0;32m'const category':'const int'[0m non_odr_use_constant
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada17e0[0m <[0;33mcol:28[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cada17c0[0m <[0;33mcol:28[0m> [0;32m'const category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cada1360[0m[0;1;36m 'messages'[0m [0;32m'const category':'const int'[0m non_odr_use_constant
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cada1918[0m <[0;33mline:127:5[0m, [0;33mcol:20[0m> [0;33mcol:5[0m referenced[0;1;36m locale[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cada1b30[0m <[0;33mline:136:5[0m, [0;33mcol:41[0m> [0;33mcol:5[0m used[0;1;36m locale[0m [0;32m'void (const locale &) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada1a00[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __other[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cada1ce0[0m <[0;33mline:146:5[0m, [0;33mline:147:27[0m> [0;33mcol:5[0m used[0;1;36m locale[0m [0;32m'void (const char *)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada1c30[0m <[0;33mcol:12[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __s[0m [0;32m'const char *'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cada2078[0m <[0;33mline:161:5[0m, [0;33mcol:65[0m> [0;33mcol:5[0m used[0;1;36m locale[0m [0;32m'void (const locale &, const char *, category)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada1de0[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __base[0m [0;32m'const locale &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada1e68[0m <[0;33mcol:34[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __s[0m [0;32m'const char *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada1ee8[0m <[0;33mcol:51[0m, [0;33mcol:60[0m> [0;33mcol:60[0m[0;1;36m __cat[0m [0;32m'category':'int'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cada2328[0m <[0;33mline:172:5[0m, [0;33mline:173:60[0m> [0;33mcol:5[0m[0;1;36m locale[0m [0;32m'void (const std::string &)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada2240[0m <[0;33mcol:12[0m, [0;33mcol:31[0m> [0;33mcol:31[0m used[0;1;36m __s[0m [0;32m'const std::string &'[0m
[0;34m| |-[0mCXXCtorInitializer [0;32m'locale':'std::locale'[0m
[0;34m| | `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x57e0cada5b18[0m <[0;33mcol:38[0m, [0;33mcol:56[0m> [0;32m'std::locale'[0m[0;36m[0m[0;36m[0m [0;32m'void (const char *)'[0m
[0;34m| |   `-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x57e0cada5958[0m <[0;33mcol:45[0m, [0;33mcol:55[0m> [0;32m'const char *'[0m[0;36m[0m[0;36m[0m
[0;34m| |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cada5928[0m <[0;33mcol:45[0m, [0;33mcol:49[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m .c_str[0;33m 0x57e0ca9f3950[0m
[0;34m| |       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cada5908[0m <[0;33mcol:45[0m> [0;32m'const std::string':'const std::basic_string<char>'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cada2240[0m[0;1;36m '__s'[0m [0;32m'const std::string &'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cada5b70[0m <[0;33mcol:58[0m, [0;33mcol:60[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cada26f8[0m <[0;33mline:187:5[0m, [0;33mline:188:44[0m> [0;33mline:187:5[0m[0;1;36m locale[0m [0;32m'void (const locale &, const std::string &, category)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada2428[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m used[0;1;36m __base[0m [0;32m'const locale &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada24f0[0m <[0;33mcol:34[0m, [0;33mcol:53[0m> [0;33mcol:53[0m used[0;1;36m __s[0m [0;32m'const std::string &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada2570[0m <[0;33mcol:58[0m, [0;33mcol:67[0m> [0;33mcol:67[0m used[0;1;36m __cat[0m [0;32m'category':'int'[0m
[0;34m| |-[0mCXXCtorInitializer [0;32m'locale':'std::locale'[0m
[0;34m| | `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x57e0cada5cc8[0m <[0;33mline:188:7[0m, [0;33mcol:40[0m> [0;32m'std::locale'[0m[0;36m[0m[0;36m[0m [0;32m'void (const locale &, const char *, category)'[0m
[0;34m| |   |-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cada5b80[0m <[0;33mcol:14[0m> [0;32m'const locale':'const std::locale'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cada2428[0m[0;1;36m '__base'[0m [0;32m'const locale &'[0m
[0;34m| |   |-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x57e0cada5bf0[0m <[0;33mcol:22[0m, [0;33mcol:32[0m> [0;32m'const char *'[0m[0;36m[0m[0;36m[0m
[0;34m| |   | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cada5bc0[0m <[0;33mcol:22[0m, [0;33mcol:26[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m .c_str[0;33m 0x57e0ca9f3950[0m
[0;34m| |   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cada5ba0[0m <[0;33mcol:22[0m> [0;32m'const std::string':'const std::basic_string<char>'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cada24f0[0m[0;1;36m '__s'[0m [0;32m'const std::string &'[0m
[0;34m| |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada5cb0[0m <[0;33mcol:35[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cada5c10[0m <[0;33mcol:35[0m> [0;32m'category':'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cada2570[0m[0;1;36m '__cat'[0m [0;32m'category':'int'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cada5d30[0m <[0;33mcol:42[0m, [0;33mcol:44[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cada2a98[0m <[0;33mline:202:5[0m, [0;33mcol:69[0m> [0;33mcol:5[0m[0;1;36m locale[0m [0;32m'void (const locale &, const locale &, category)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada2808[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __base[0m [0;32m'const locale &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada2890[0m <[0;33mcol:34[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m __add[0m [0;32m'const locale &'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada2910[0m <[0;33mcol:55[0m, [0;33mcol:64[0m> [0;33mcol:64[0m[0;1;36m __cat[0m [0;32m'category':'int'[0m
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x57e0cada2f10[0m <[0;33mline:215:5[0m, [0;33mline:216:48[0m> [0;33mcol:7[0m[0;1;36m locale[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0cada2b90[0m <[0;33mline:215:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m referenced typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m| `-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cada2e58[0m <[0;33mline:216:7[0m, [0;33mcol:48[0m> [0;33mcol:7[0m[0;1;36m locale[0m [0;32m'void (const locale &, _Facet *)'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada2c50[0m <[0;33mcol:14[0m, [0;33mcol:28[0m> [0;33mcol:28[0m[0;1;36m __other[0m [0;32m'const locale &'[0m
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada2d08[0m <[0;33mcol:37[0m, [0;33mcol:45[0m> [0;33mcol:45[0m[0;1;36m __f[0m [0;32m'_Facet *'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x57e0cada2ff8[0m <[0;33mline:219:5[0m, [0;33mcol:21[0m> [0;33mcol:5[0m used[0;1;36m ~locale[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cada3228[0m <[0;33mline:229:5[0m, [0;33mline:230:44[0m> [0;33mcol:5[0m used[0;1;36m operator=[0m [0;32m'const locale &(const locale &) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada30e8[0m <[0;33mcol:15[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m __other[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x57e0cada35d8[0m <[0;33mline:244:5[0m, [0;33mline:247:38[0m> [0;33mcol:7[0m[0;1;36m combine[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0cada32f8[0m <[0;33mline:244:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cada3528[0m <[0;33mline:246:7[0m, [0;33mline:247:38[0m> [0;33mcol:7[0m[0;1;36m combine[0m [0;32m'locale (const locale &) const'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada33c0[0m <[0;33mcol:15[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m __other[0m [0;32m'const locale &'[0m
[0;34m|   `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cada3638[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cada3758[0m <[0;33mline:168:33[0m, [0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:256:12[0m> [0;33mcol:5[0m[0;1;36m name[0m [0;32m'string () const'[0m
[0;34m| |-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cada3800[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x57e0cada3860[0m <[0;33mline:168:47[0m, [0;33mcol:67[0m> cxx11
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cada3a10[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:276:5[0m, [0;33mline:277:51[0m> [0;33mcol:5[0m[0;1;36m operator==[0m [0;32m'bool (const locale &) const throw()'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada38e0[0m <[0;33mcol:16[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m __other[0m [0;32m'const locale &'[0m
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cada3ac0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x57e0cada4288[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:307:5[0m, [0;33mline:311:54[0m> [0;33mline:310:7[0m[0;1;36m operator()[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0cada3b40[0m <[0;33mline:307:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m referenced typename depth 0 index 0[0;1;36m _Char[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0cada3bc8[0m <[0;33mcol:30[0m, [0;33mcol:39[0m> [0;33mcol:39[0m referenced typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0cada3c58[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;33mcol:57[0m referenced typename depth 0 index 2[0;1;36m _Alloc[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cada41d8[0m <[0;33mline:309:7[0m, [0;33mline:311:54[0m> [0;33mline:310:7[0m[0;1;36m operator()[0m [0;32m'bool (const basic_string<_Char, _Traits, _Alloc> &, const basic_string<_Char, _Traits, _Alloc> &) const'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada3e90[0m <[0;33mcol:18[0m, [0;33mcol:62[0m> [0;33mcol:62[0m[0;1;36m __s1[0m [0;32m'const basic_string<_Char, _Traits, _Alloc> &'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada4080[0m <[0;33mline:311:4[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m __s2[0m [0;32m'const basic_string<_Char, _Traits, _Alloc> &'[0m
[0;34m|   `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cada42f0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cada44b8[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:324:5[0m, [0;33mline:325:31[0m> [0;33mcol:5[0m[0;1;36m global[0m [0;32m'locale (const locale &)'[0m static
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada4388[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cada4610[0m <[0;33mline:331:5[0m, [0;33mline:332:13[0m> [0;33mcol:5[0m[0;1;36m classic[0m [0;32m'const locale &()'[0m static
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cada46b8[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cada4738[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:334:3[0m, [0;33mcol:10[0m> [0;33mcol:3[0m private
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cada4810[0m <[0;33mline:336:5[0m, [0;33mcol:13[0m> [0;33mcol:13[0m referenced[0;1;36m _M_impl[0m [0;32m'_Impl *'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cada4880[0m <[0;33mline:339:5[0m, [0;33mcol:25[0m> [0;33mcol:25[0m[0;1;36m _S_classic[0m [0;32m'_Impl *'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cada4920[0m <[0;33mline:342:5[0m, [0;33mcol:19[0m> [0;33mcol:19[0m[0;1;36m _S_global[0m [0;32m'_Impl *'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cada49c0[0m <[0;33mline:348:5[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m _S_categories[0m [0;32m'const char *const *const'[0m static
[0;34m|-[0m[0;1;32mEnumDecl[0m[0;33m 0x57e0cada4a48[0m <[0;33mline:360:5[0m, [0;33mcol:61[0m> [0;33mcol:5[0m
[0;34m| `-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x57e0cada4ba8[0m <[0;33mcol:12[0m, [0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++locale.h:45:33[0m> [0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:360:12[0m referenced[0;1;36m _S_categories_size[0m [0;32m'std::locale::(unnamed enum at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:360:5)'[0m
[0;34m|   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cada4c00[0m <[0;33mcol:33[0m, [0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++locale.h:45:33[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|     `-[0m[0;1;35mConstantExpr[0m[0;33m 0x57e0cada4b80[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:360:33[0m, [0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++locale.h:45:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m
[0;34m|       |-value: [0m[0;36mInt [0;1;36m12[0m[0m
[0;34m|       `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cada4b60[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:360:33[0m, [0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++locale.h:45:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m '+'
[0;34m|         |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada4b20[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:360:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 6[0m
[0;34m|         `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cada4b40[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++locale.h:45:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 6[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cada4c30[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_classes.h:363:5[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m _S_once[0m [0;32m'__gthread_once_t':'int'[0m static
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cada4e00[0m <[0;33mline:366:5[0m, [0;33mline:367:26[0m> [0;33mcol:5[0m referenced[0;1;36m locale[0m [0;32m'void (_Impl *) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada4cd0[0m <[0;33mcol:12[0m, [0;33mcol:17[0m> [0;33mcol:18[0m [0;32m'_Impl *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cada4f08[0m <[0;33mline:369:5[0m, [0;33mline:370:19[0m> [0;33mcol:5[0m[0;1;36m _S_initialize[0m [0;32m'void ()'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cada4ff8[0m <[0;33mline:372:5[0m, [0;33mline:373:32[0m> [0;33mcol:5[0m[0;1;36m _S_initialize_once[0m [0;32m'void () throw()'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cada51b8[0m <[0;33mline:375:5[0m, [0;33mline:376:35[0m> [0;33mcol:5[0m[0;1;36m _S_normalize_category[0m [0;32m'category (category)'[0m static
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada50d0[0m <[0;33mcol:27[0m> [0;33mcol:35[0m [0;32m'category':'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cada5498[0m <[0;33mline:378:5[0m, [0;33mline:379:74[0m> [0;33mcol:5[0m[0;1;36m _M_coalesce[0m [0;32m'void (const locale &, const locale &, category)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada52a0[0m <[0;33mcol:17[0m, [0;33mcol:31[0m> [0;33mcol:31[0m[0;1;36m __base[0m [0;32m'const locale &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada5328[0m <[0;33mcol:39[0m, [0;33mcol:53[0m> [0;33mcol:53[0m[0;1;36m __add[0m [0;32m'const locale &'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cada53a8[0m <[0;33mcol:60[0m, [0;33mcol:69[0m> [0;33mcol:69[0m[0;1;36m __cat[0m [0;32m'category':'int'[0m
[0;34m`-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cada5690[0m <[0;33mline:382:5[0m, [0;33mcol:46[0m> [0;33mcol:28[0m[0;1;36m _S_twinned_facets[0m [0;32m'const id *const[]'[0m static

Layout: <CGRecordLayout
  LLVMType:%"class.std::locale" = type { ptr }
  NonVirtualBaseLLVMType:%"class.std::locale" = type { ptr }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cae7f078[0m prev 0x57e0c9bf5e78 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ios_base.h:265:3[0m, [0;33mline:951:3[0m> [0;33mline:265:9[0m referenced class[0;1;36m ios_base[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m needs_overload_resolution
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m needs_overload_resolution
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared needs_overload_resolution
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cae7f178[0m <[0;33mcol:3[0m, [0;33mcol:9[0m> [0;33mcol:9[0m implicit referenced class[0;1;36m ios_base[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cae7f228[0m <[0;33mline:283:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cae7f278[0m <[0;33mline:292:5[0m, [0;33mline:311:5[0m> [0;33mline:292:34[0m class[0;1;36m failure[0m definition
[0;34m| |-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m needs_overload_resolution
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m needs_overload_resolution
[0;34m| | `-[0m[0;1;32mDestructor[0m non_trivial user_declared needs_overload_resolution
[0;34m| |-[0mpublic [0;32m'system_error':'std::system_error'[0m
[0;34m| |-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x57e0cae7f3a8[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:168:47[0m, [0;33mcol:67[0m> cxx11
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cae7f470[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ios_base.h:292:5[0m, [0;33mcol:34[0m> [0;33mcol:34[0m implicit referenced class[0;1;36m failure[0m
[0;34m| |-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cae7f520[0m <[0;33mline:294:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae7f660[0m <[0;33mline:295:7[0m, [0;33mline:296:34[0m> [0;33mcol:7[0m[0;1;36m failure[0m [0;32m'void (const string &)'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae7f568[0m <[0;33mcol:15[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m __str[0m [0;32m'const string &'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae7f928[0m <[0;33mline:299:7[0m, [0;33mline:300:47[0m> [0;33mcol:7[0m[0;1;36m failure[0m [0;32m'void (const string &, const error_code &)'[0m
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae7f750[0m <[0;33mcol:15[0m, [0;33mcol:27[0m> [0;33mcol:28[0m [0;32m'const string &'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae7f7d8[0m <[0;33mcol:30[0m, [0;33mcol:46[0m> [0;33mcol:47[0m [0;32m'const error_code &'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae7fc08[0m <[0;33mline:302:7[0m, [0;33mline:303:63[0m> [0;33mcol:7[0m[0;1;36m failure[0m [0;32m'void (const char *, const error_code &)'[0m
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae7fa30[0m <[0;33mcol:15[0m, [0;33mcol:25[0m> [0;33mcol:26[0m [0;32m'const char *'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae7fab8[0m <[0;33mcol:28[0m, [0;33mcol:57[0m> [0;33mcol:46[0m [0;32m'const error_code &'[0m cinit
[0;34m| |   `-[0m[0;1;35mExprWithCleanups[0m[0;33m 0x57e0cae895b0[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;32m'const error_code':'const std::error_code'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m| |     `-[0m[0;1;35mMaterializeTemporaryExpr[0m[0;33m 0x57e0cae89598[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;32m'const error_code':'const std::error_code'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m| |       `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x57e0cae89568[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;32m'const error_code':'const std::error_code'[0m[0;36m[0m[0;36m[0m [0;32m'void (std::io_errc) noexcept'[0m
[0;34m| |         `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae88d28[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;32m'std::io_errc'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae7e308[0m[0;1;36m 'stream'[0m [0;32m'std::io_errc'[0m
[0;34m| |           `-[0mNestedNameSpecifier TypeSpec [0;32m'std::io_errc'[0m
[0;34m| |-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x57e0cae7fd78[0m <[0;33mline:306:7[0m, [0;33mline:307:24[0m> [0;33mcol:7[0m[0;1;36m ~failure[0m [0;32m'void () throw()'[0m virtual
[0;34m| | `-[0mOverrides: [ 0x57e0cae3b380 system_error::~system_error 'void () noexcept' ]
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae7fee8[0m <[0;33mline:309:7[0m, [0;33mline:310:26[0m> [0;33mcol:7[0m[0;1;36m what[0m [0;32m'const char *() const throw()'[0m virtual
[0;34m| | `-[0mOverrides: [ 0x57e0cadf81b8 runtime_error::what 'const char *() const noexcept' ]
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae80018[0m <[0;33mline:292:34[0m> [0;33mcol:34[0m implicit[0;1;36m failure[0m [0;32m'void (const failure &)'[0m inline default noexcept-unevaluated 0x57e0cae80018
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae80158[0m <[0;33mcol:34[0m> [0;33mcol:34[0m [0;32m'const failure &'[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae80218[0m <[0;33mcol:34[0m> [0;33mcol:34[0m implicit[0;1;36m operator=[0m [0;32m'failure &(const failure &)'[0m inline default noexcept-unevaluated 0x57e0cae80218
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae80348[0m <[0;33mcol:34[0m> [0;33mcol:34[0m [0;32m'const failure &'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cae80400[0m <[0;33mline:378:5[0m, [0;33mcol:27[0m> [0;33mcol:27[0m referenced[0;1;36m fmtflags[0m [0;32m'_Ios_Fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cae76fc0[0m [0;32m'_Ios_Fmtflags'[0m sugar
[0;34m|   `-[0m[0;32mEnumType[0m[0;33m 0x57e0cae75b60[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|     `-[0m[0;1;32mEnum[0m[0;33m 0x57e0cae75aa0[0m[0;1;36m '_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae804d8[0m <[0;33mline:381:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m boolalpha[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae80540[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae75c08[0m[0;1;36m '_S_boolalpha'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae805d8[0m <[0;33mline:384:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m dec[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae80640[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae75ce8[0m[0;1;36m '_S_dec'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae806d8[0m <[0;33mline:387:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m fixed[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae80740[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae75dc8[0m[0;1;36m '_S_fixed'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae807d8[0m <[0;33mline:390:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m hex[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae80840[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae75ea8[0m[0;1;36m '_S_hex'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae808d8[0m <[0;33mline:395:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m internal[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae80940[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae75f88[0m[0;1;36m '_S_internal'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae809d8[0m <[0;33mline:399:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m left[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae80a40[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae76068[0m[0;1;36m '_S_left'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae80ad8[0m <[0;33mline:402:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m oct[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae80b40[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae76148[0m[0;1;36m '_S_oct'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae80bd8[0m <[0;33mline:406:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m right[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae80c40[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae76228[0m[0;1;36m '_S_right'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae80cd8[0m <[0;33mline:409:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m scientific[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae80d40[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae76308[0m[0;1;36m '_S_scientific'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae80dd8[0m <[0;33mline:413:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m showbase[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae80e40[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae763e8[0m[0;1;36m '_S_showbase'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae80ed8[0m <[0;33mline:417:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m showpoint[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae80f40[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae764c8[0m[0;1;36m '_S_showpoint'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae80fd8[0m <[0;33mline:420:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m showpos[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81040[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae765a8[0m[0;1;36m '_S_showpos'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae810d8[0m <[0;33mline:423:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m skipws[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81140[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae76688[0m[0;1;36m '_S_skipws'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae811d8[0m <[0;33mline:426:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m unitbuf[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81240[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae76768[0m[0;1;36m '_S_unitbuf'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae812d8[0m <[0;33mline:430:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m uppercase[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81340[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae76848[0m[0;1;36m '_S_uppercase'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae813d8[0m <[0;33mline:433:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m adjustfield[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81440[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae76968[0m[0;1;36m '_S_adjustfield'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae814d8[0m <[0;33mline:436:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m basefield[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81540[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae76a88[0m[0;1;36m '_S_basefield'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae815d8[0m <[0;33mline:439:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m floatfield[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81640[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae76b68[0m[0;1;36m '_S_floatfield'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cae816d8[0m <[0;33mline:453:5[0m, [0;33mcol:26[0m> [0;33mcol:26[0m referenced[0;1;36m iostate[0m [0;32m'_Ios_Iostate':'std::_Ios_Iostate'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cae7bf50[0m [0;32m'_Ios_Iostate'[0m sugar
[0;34m|   `-[0m[0;32mEnumType[0m[0;33m 0x57e0cae7b950[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|     `-[0m[0;1;32mEnum[0m[0;33m 0x57e0cae7b898[0m[0;1;36m '_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae817a8[0m <[0;33mline:457:5[0m, [0;33mcol:35[0m> [0;33mcol:26[0m referenced[0;1;36m badbit[0m [0;32m'const iostate':'const std::_Ios_Iostate'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81810[0m <[0;33mcol:35[0m> [0;32m'std::_Ios_Iostate'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae7ba98[0m[0;1;36m '_S_badbit'[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae818a8[0m <[0;33mline:460:5[0m, [0;33mcol:35[0m> [0;33mcol:26[0m referenced[0;1;36m eofbit[0m [0;32m'const iostate':'const std::_Ios_Iostate'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81910[0m <[0;33mcol:35[0m> [0;32m'std::_Ios_Iostate'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae7bb78[0m[0;1;36m '_S_eofbit'[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae819a8[0m <[0;33mline:465:5[0m, [0;33mcol:36[0m> [0;33mcol:26[0m referenced[0;1;36m failbit[0m [0;32m'const iostate':'const std::_Ios_Iostate'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81a10[0m <[0;33mcol:36[0m> [0;32m'std::_Ios_Iostate'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae7bc58[0m[0;1;36m '_S_failbit'[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae81aa8[0m <[0;33mline:468:5[0m, [0;33mcol:36[0m> [0;33mcol:26[0m referenced[0;1;36m goodbit[0m [0;32m'const iostate':'const std::_Ios_Iostate'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81b10[0m <[0;33mcol:36[0m> [0;32m'std::_Ios_Iostate'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae7b9b8[0m[0;1;36m '_S_goodbit'[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cae81ba8[0m <[0;33mline:484:5[0m, [0;33mcol:27[0m> [0;33mcol:27[0m referenced[0;1;36m openmode[0m [0;32m'_Ios_Openmode':'std::_Ios_Openmode'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cae79a00[0m [0;32m'_Ios_Openmode'[0m sugar
[0;34m|   `-[0m[0;32mEnumType[0m[0;33m 0x57e0cae78f10[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|     `-[0m[0;1;32mEnum[0m[0;33m 0x57e0cae78e58[0m[0;1;36m '_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae81c78[0m <[0;33mline:487:5[0m, [0;33mcol:34[0m> [0;33mcol:27[0m[0;1;36m app[0m [0;32m'const openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81ce0[0m <[0;33mcol:34[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae79010[0m[0;1;36m '_S_app'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae81d78[0m <[0;33mline:490:5[0m, [0;33mcol:34[0m> [0;33mcol:27[0m[0;1;36m ate[0m [0;32m'const openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81de0[0m <[0;33mcol:34[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae790f0[0m[0;1;36m '_S_ate'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae81e78[0m <[0;33mline:495:5[0m, [0;33mcol:36[0m> [0;33mcol:27[0m[0;1;36m binary[0m [0;32m'const openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81ee0[0m <[0;33mcol:36[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae791d0[0m[0;1;36m '_S_bin'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae81f78[0m <[0;33mline:498:5[0m, [0;33mcol:33[0m> [0;33mcol:27[0m referenced[0;1;36m in[0m [0;32m'const openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae81fe0[0m <[0;33mcol:33[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae792b0[0m[0;1;36m '_S_in'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae82078[0m <[0;33mline:501:5[0m, [0;33mcol:34[0m> [0;33mcol:27[0m referenced[0;1;36m out[0m [0;32m'const openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae820e0[0m <[0;33mcol:34[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae79390[0m[0;1;36m '_S_out'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae82178[0m <[0;33mline:504:5[0m, [0;33mcol:35[0m> [0;33mcol:27[0m[0;1;36m trunc[0m [0;32m'const openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae821e0[0m <[0;33mcol:35[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae79470[0m[0;1;36m '_S_trunc'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae82278[0m <[0;33mline:506:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m[0;1;36m __noreplace[0m [0;32m'const openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae822e0[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae79550[0m[0;1;36m '_S_noreplace'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cae823a8[0m <[0;33mline:523:5[0m, [0;33mcol:26[0m> [0;33mcol:26[0m referenced[0;1;36m seekdir[0m [0;32m'_Ios_Seekdir':'std::_Ios_Seekdir'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cae82360[0m [0;32m'_Ios_Seekdir'[0m sugar
[0;34m|   `-[0m[0;32mEnumType[0m[0;33m 0x57e0cae7dea0[0m [0;32m'std::_Ios_Seekdir'[0m
[0;34m|     `-[0m[0;1;32mEnum[0m[0;33m 0x57e0cae7dde8[0m[0;1;36m '_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae82478[0m <[0;33mline:526:5[0m, [0;33mcol:33[0m> [0;33mcol:26[0m[0;1;36m beg[0m [0;32m'const seekdir':'const std::_Ios_Seekdir'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae824e0[0m <[0;33mcol:33[0m> [0;32m'std::_Ios_Seekdir'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae7df08[0m[0;1;36m '_S_beg'[0m [0;32m'std::_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae82578[0m <[0;33mline:529:5[0m, [0;33mcol:33[0m> [0;33mcol:26[0m referenced[0;1;36m cur[0m [0;32m'const seekdir':'const std::_Ios_Seekdir'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae825e0[0m <[0;33mcol:33[0m> [0;32m'std::_Ios_Seekdir'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae7dfa8[0m[0;1;36m '_S_cur'[0m [0;32m'std::_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae82678[0m <[0;33mline:532:5[0m, [0;33mcol:33[0m> [0;33mcol:26[0m[0;1;36m end[0m [0;32m'const seekdir':'const std::_Ios_Seekdir'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae826e0[0m <[0;33mcol:33[0m> [0;32m'std::_Ios_Seekdir'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x57e0cae7e048[0m[0;1;36m '_S_end'[0m [0;32m'std::_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mEnumDecl[0m[0;33m 0x57e0cae82768[0m <[0;33mline:556:5[0m, [0;33mline:561:5[0m> [0;33mline:556:10[0m referenced[0;1;36m event[0m
[0;34m| |-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x57e0cae82848[0m <[0;33mline:558:7[0m> [0;33mcol:7[0m referenced[0;1;36m erase_event[0m [0;32m'std::ios_base::event'[0m
[0;34m| |-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x57e0cae828a8[0m <[0;33mline:559:7[0m> [0;33mcol:7[0m[0;1;36m imbue_event[0m [0;32m'std::ios_base::event'[0m
[0;34m| `-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x57e0cae82908[0m <[0;33mline:560:7[0m> [0;33mcol:7[0m referenced[0;1;36m copyfmt_event[0m [0;32m'std::ios_base::event'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cae82d80[0m <[0;33mline:573:5[0m, [0;33mcol:70[0m> [0;33mcol:20[0m referenced[0;1;36m event_callback[0m [0;32m'void (*)(event, ios_base &, int)'[0m
[0;34m| `-[0m[0;32mPointerType[0m[0;33m 0x57e0cae82d00[0m [0;32m'void (*)(event, ios_base &, int)'[0m
[0;34m|   `-[0m[0;32mParenType[0m[0;33m 0x57e0cae82ca0[0m [0;32m'void (event, ios_base &, int)'[0m sugar
[0;34m|     `-[0m[0;32mFunctionProtoType[0m[0;33m 0x57e0cae82c50[0m [0;32m'void (event, ios_base &, int)'[0m cdecl
[0;34m|       |-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5820[0m [0;32m'void'[0m
[0;34m|       |-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cae82960[0m [0;32m'event'[0m sugar
[0;34m|       | `-[0m[0;32mEnumType[0m[0;33m 0x57e0cae82820[0m [0;32m'std::ios_base::event'[0m
[0;34m|       |   `-[0m[0;1;32mEnum[0m[0;33m 0x57e0cae82768[0m[0;1;36m 'event'[0m
[0;34m|       |-[0m[0;32mLValueReferenceType[0m[0;33m 0x57e0cae82a70[0m [0;32m'ios_base &'[0m
[0;34m|       | `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cae82a10[0m [0;32m'ios_base'[0m sugar
[0;34m|       |   `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9bf5f20[0m [0;32m'std::ios_base'[0m
[0;34m|       |     `-[0m[0;1;32mCXXRecord[0m[0;33m 0x57e0cae7f078[0m[0;1;36m 'ios_base'[0m
[0;34m|       `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad58c0[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae83068[0m <[0;33mline:585:5[0m, [0;33mline:586:55[0m> [0;33mcol:5[0m[0;1;36m register_callback[0m [0;32m'void (event_callback, int)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae82e58[0m <[0;33mcol:23[0m, [0;33mcol:38[0m> [0;33mcol:38[0m[0;1;36m __fn[0m [0;32m'event_callback':'void (*)(event, ios_base &, int)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae82ee0[0m <[0;33mcol:44[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m __index[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cae83140[0m <[0;33mline:588:3[0m, [0;33mcol:12[0m> [0;33mcol:3[0m protected
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae83180[0m <[0;33mline:589:5[0m, [0;33mcol:17[0m> [0;33mcol:17[0m referenced[0;1;36m _M_precision[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae831e8[0m <[0;33mline:590:5[0m, [0;33mcol:17[0m> [0;33mcol:17[0m referenced[0;1;36m _M_width[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae83250[0m <[0;33mline:591:5[0m, [0;33mcol:15[0m> [0;33mcol:15[0m referenced[0;1;36m _M_flags[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae832b8[0m <[0;33mline:592:5[0m, [0;33mcol:14[0m> [0;33mcol:14[0m referenced[0;1;36m _M_exception[0m [0;32m'iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae83320[0m <[0;33mline:593:5[0m, [0;33mcol:14[0m> [0;33mcol:14[0m referenced[0;1;36m _M_streambuf_state[0m [0;32m'iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cae83378[0m <[0;33mline:597:5[0m, [0;33mline:625:5[0m> [0;33mline:597:12[0m referenced struct[0;1;36m _Callback_list[0m definition
[0;34m| |-[0m[0;1;32mDefinitionData[0m pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m defaulted_is_constexpr
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param needs_implicit implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m exists simple trivial needs_implicit
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m simple trivial has_const_param needs_implicit implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m exists simple trivial needs_implicit
[0;34m| | `-[0m[0;1;32mDestructor[0m simple irrelevant trivial constexpr needs_implicit
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cae834b0[0m <[0;33mcol:5[0m, [0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced struct[0;1;36m _Callback_list[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae83610[0m <[0;33mline:600:7[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m _M_next[0m [0;32m'_Callback_list *'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae83718[0m <[0;33mline:601:7[0m, [0;33mcol:32[0m> [0;33mcol:32[0m[0;1;36m _M_fn[0m [0;32m'ios_base::event_callback':'void (*)(event, ios_base &, int)'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae83788[0m <[0;33mline:602:7[0m, [0;33mcol:13[0m> [0;33mcol:13[0m[0;1;36m _M_index[0m [0;32m'int'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae837f0[0m <[0;33mline:603:7[0m, [0;33mcol:21[0m> [0;33mcol:21[0m referenced[0;1;36m _M_refcount[0m [0;32m'_Atomic_word':'int'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae83b58[0m <[0;33mline:605:7[0m, [0;33mline:607:73[0m> [0;33mline:605:7[0m[0;1;36m _Callback_list[0m [0;32m'void (ios_base::event_callback, int, _Callback_list *)'[0m implicit-inline
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae838a0[0m <[0;33mcol:22[0m, [0;33mcol:47[0m> [0;33mcol:47[0m used[0;1;36m __fn[0m [0;32m'ios_base::event_callback':'void (*)(event, ios_base &, int)'[0m
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae83928[0m <[0;33mcol:53[0m, [0;33mcol:57[0m> [0;33mcol:57[0m used[0;1;36m __index[0m [0;32m'int'[0m
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae839b0[0m <[0;33mline:606:8[0m, [0;33mcol:24[0m> [0;33mcol:24[0m used[0;1;36m __cb[0m [0;32m'_Callback_list *'[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x57e0cae83610[0m[0;1;36m '_M_next'[0m [0;32m'_Callback_list *'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae89750[0m <[0;33mline:607:17[0m> [0;32m'_Callback_list *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae89710[0m <[0;33mcol:17[0m> [0;32m'_Callback_list *'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae839b0[0m[0;1;36m '__cb'[0m [0;32m'_Callback_list *'[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x57e0cae83718[0m[0;1;36m '_M_fn'[0m [0;32m'ios_base::event_callback':'void (*)(event, ios_base &, int)'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae897c8[0m <[0;33mcol:30[0m> [0;32m'ios_base::event_callback':'void (*)(event, ios_base &, int)'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae89788[0m <[0;33mcol:30[0m> [0;32m'ios_base::event_callback':'void (*)(event, ios_base &, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae838a0[0m[0;1;36m '__fn'[0m [0;32m'ios_base::event_callback':'void (*)(event, ios_base &, int)'[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x57e0cae83788[0m[0;1;36m '_M_index'[0m [0;32m'int'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae89840[0m <[0;33mcol:46[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae89800[0m <[0;33mcol:46[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae83928[0m[0;1;36m '__index'[0m [0;32m'int'[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x57e0cae837f0[0m[0;1;36m '_M_refcount'[0m [0;32m'_Atomic_word':'int'[0m
[0;34m| | | `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cae89878[0m <[0;33mcol:68[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae898f8[0m <[0;33mcol:71[0m, [0;33mcol:73[0m>
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae83c60[0m <[0;33mline:609:7[0m, [0;33mline:610:79[0m> [0;33mcol:7[0m referenced[0;1;36m _M_add_reference[0m [0;32m'void ()'[0m implicit-inline
[0;34m| | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae89a48[0m <[0;33mcol:26[0m, [0;33mcol:79[0m>
[0;34m| |   `-[0m[0;1;35mCallExpr[0m[0;33m 0x57e0cae89a18[0m <[0;33mcol:28[0m, [0;33mcol:76[0m> [0;32m'void'[0m[0;36m[0m[0;36m[0m
[0;34m| |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae89a00[0m <[0;33mcol:28[0m, [0;33mcol:39[0m> [0;32m'void (*)(_Atomic_word *, int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m| |     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae89958[0m <[0;33mcol:28[0m, [0;33mcol:39[0m> [0;32m'void (_Atomic_word *, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x57e0ca0c3030[0m[0;1;36m '__atomic_add_dispatch'[0m [0;32m'void (_Atomic_word *, int)'[0m
[0;34m| |     |   `-[0mNestedNameSpecifier [0;1;32mNamespace[0m[0;33m 0x57e0ca9ad998[0m[0;1;36m '__gnu_cxx'[0m
[0;34m| |     |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x57e0cae899c8[0m <[0;33mcol:61[0m, [0;33mcol:62[0m> [0;32m'_Atomic_word *'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m| |     | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae89998[0m <[0;33mcol:62[0m> [0;32m'_Atomic_word':'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_refcount[0;33m 0x57e0cae837f0[0m
[0;34m| |     |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae89988[0m <[0;33mcol:62[0m> [0;32m'std::ios_base::_Callback_list *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| |     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cae899e0[0m <[0;33mcol:75[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae83d50[0m <[0;33mline:613:7[0m, [0;33mline:624:7[0m> [0;33mline:614:7[0m[0;1;36m _M_remove_reference[0m [0;32m'int ()'[0m implicit-inline
[0;34m|   `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae89d48[0m <[0;33mline:615:7[0m, [0;33mline:624:7[0m>
[0;34m|     |-[0m[0;1;35mNullStmt[0m[0;33m 0x57e0cae89a60[0m <[0;33mline:617:62[0m>
[0;34m|     |-[0m[0;1;35mDeclStmt[0m[0;33m 0x57e0cae89c30[0m <[0;33mline:618:9[0m, [0;33mcol:77[0m>
[0;34m|     | `-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae89a88[0m <[0;33mcol:9[0m, [0;33mcol:76[0m> [0;33mcol:13[0m used[0;1;36m __res[0m [0;32m'int'[0m cinit
[0;34m|     |   `-[0m[0;1;35mCallExpr[0m[0;33m 0x57e0cae89be8[0m <[0;33mcol:21[0m, [0;33mcol:76[0m> [0;32m'_Atomic_word':'int'[0m[0;36m[0m[0;36m[0m
[0;34m|     |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae89bd0[0m <[0;33mcol:21[0m, [0;33mcol:32[0m> [0;32m'_Atomic_word (*)(_Atomic_word *, int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     |     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae89b10[0m <[0;33mcol:21[0m, [0;33mcol:32[0m> [0;32m'_Atomic_word (_Atomic_word *, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x57e0ca0c2968[0m[0;1;36m '__exchange_and_add_dispatch'[0m [0;32m'_Atomic_word (_Atomic_word *, int)'[0m
[0;34m|     |     |   `-[0mNestedNameSpecifier [0;1;32mNamespace[0m[0;33m 0x57e0ca9ad998[0m[0;1;36m '__gnu_cxx'[0m
[0;34m|     |     |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x57e0cae89b80[0m <[0;33mcol:60[0m, [0;33mcol:61[0m> [0;32m'_Atomic_word *'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m|     |     | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae89b50[0m <[0;33mcol:61[0m> [0;32m'_Atomic_word':'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_refcount[0;33m 0x57e0cae837f0[0m
[0;34m|     |     |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae89b40[0m <[0;33mcol:61[0m> [0;32m'std::ios_base::_Callback_list *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     |     `-[0m[0;1;35mUnaryOperator[0m[0;33m 0x57e0cae89bb8[0m <[0;33mcol:74[0m, [0;33mcol:75[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m prefix '-'
[0;34m|     |       `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cae89b98[0m <[0;33mcol:75[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     |-[0m[0;1;35mIfStmt[0m[0;33m 0x57e0cae89ce0[0m <[0;33mline:619:9[0m, [0;33mline:622:11[0m>
[0;34m|     | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cae89ca0[0m <[0;33mline:619:13[0m, [0;33mcol:22[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '=='
[0;34m|     | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae89c88[0m <[0;33mcol:13[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae89c48[0m <[0;33mcol:13[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cae89a88[0m[0;1;36m '__res'[0m [0;32m'int'[0m
[0;34m|     | | `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cae89c68[0m <[0;33mcol:22[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m|     | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae89cc8[0m <[0;33mline:620:11[0m, [0;33mline:622:11[0m>
[0;34m|     |   `-[0m[0;1;35mNullStmt[0m[0;33m 0x57e0cae89cc0[0m <[0;33mline:621:65[0m>
[0;34m|     `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae89d38[0m <[0;33mline:623:9[0m, [0;33mcol:16[0m>
[0;34m|       `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae89d20[0m <[0;33mcol:16[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|         `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae89d00[0m <[0;33mcol:16[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cae89a88[0m[0;1;36m '__res'[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae83e48[0m <[0;33mline:627:6[0m, [0;33mcol:22[0m> [0;33mcol:22[0m referenced[0;1;36m _M_callbacks[0m [0;32m'_Callback_list *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae83fe0[0m <[0;33mline:629:5[0m, [0;33mline:630:41[0m> [0;33mcol:5[0m referenced[0;1;36m _M_call_callbacks[0m [0;32m'void (event) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae83eb0[0m <[0;33mcol:23[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m __ev[0m [0;32m'event':'std::ios_base::event'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae84170[0m <[0;33mline:632:5[0m, [0;33mline:633:38[0m> [0;33mcol:5[0m referenced[0;1;36m _M_dispose_callbacks[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cae84238[0m <[0;33mline:636:5[0m, [0;33mline:641:5[0m> [0;33mline:636:12[0m referenced struct[0;1;36m _Words[0m definition
[0;34m| |-[0m[0;1;32mDefinitionData[0m pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided defaulted_is_constexpr
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m exists simple trivial
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m simple trivial has_const_param implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m exists simple trivial
[0;34m| | `-[0m[0;1;32mDestructor[0m simple irrelevant trivial constexpr
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cae84370[0m <[0;33mcol:5[0m, [0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced struct[0;1;36m _Words[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae84438[0m <[0;33mline:638:7[0m, [0;33mcol:13[0m> [0;33mcol:13[0m referenced[0;1;36m _M_pword[0m [0;32m'void *'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae844a8[0m <[0;33mline:639:7[0m, [0;33mcol:12[0m> [0;33mcol:12[0m referenced[0;1;36m _M_iword[0m [0;32m'long'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae84570[0m <[0;33mline:640:7[0m, [0;33mcol:45[0m> [0;33mcol:7[0m referenced[0;1;36m _Words[0m [0;32m'void ()'[0m implicit-inline
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x57e0cae84438[0m[0;1;36m '_M_pword'[0m [0;32m'void *'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae89db8[0m <[0;33mcol:27[0m> [0;32m'void *'[0m[0;36m[0m[0;36m[0m <[0;31mNullToPointer[0m>
[0;34m| | |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cae89d78[0m <[0;33mcol:27[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x57e0cae844a8[0m[0;1;36m '_M_iword'[0m [0;32m'long'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae89e30[0m <[0;33mcol:40[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m| | |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cae89df0[0m <[0;33mcol:40[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae89e78[0m <[0;33mcol:43[0m, [0;33mcol:45[0m>
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae88578[0m <[0;33mline:636:12[0m> [0;33mcol:12[0m implicit constexpr[0;1;36m _Words[0m [0;32m'void (const _Words &)'[0m inline default trivial noexcept-unevaluated 0x57e0cae88578
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae886b8[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'const _Words &'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae887a8[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit constexpr[0;1;36m _Words[0m [0;32m'void (_Words &&)'[0m inline default trivial noexcept-unevaluated 0x57e0cae887a8
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae888e8[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'_Words &&'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae88970[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit[0;1;36m operator=[0m [0;32m'_Words &(const _Words &)'[0m inline default trivial noexcept-unevaluated 0x57e0cae88970
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae88aa8[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'const _Words &'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae88b20[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit[0;1;36m operator=[0m [0;32m'_Words &(_Words &&)'[0m inline default trivial noexcept-unevaluated 0x57e0cae88b20
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae88c58[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'_Words &&'[0m
[0;34m| `-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x57e0cb011cb0[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced constexpr[0;1;36m ~_Words[0m [0;32m'void () noexcept'[0m inline default trivial
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae84698[0m <[0;33mline:644:5[0m, [0;33mcol:13[0m> [0;33mcol:13[0m[0;1;36m _M_word_zero[0m [0;32m'_Words':'std::ios_base::_Words'[0m
[0;34m|-[0m[0;1;32mEnumDecl[0m[0;33m 0x57e0cae84788[0m <[0;33mline:648:5[0m, [0;33mcol:35[0m> [0;33mcol:5[0m
[0;34m| `-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x57e0cae848a8[0m <[0;33mcol:12[0m, [0;33mcol:33[0m> [0;33mcol:12[0m referenced[0;1;36m _S_local_word_size[0m [0;32m'std::ios_base::(unnamed enum at /usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ios_base.h:648:5)'[0m
[0;34m|   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae84900[0m <[0;33mcol:33[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|     `-[0m[0;1;35mConstantExpr[0m[0;33m 0x57e0cae84880[0m <[0;33mcol:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m
[0;34m|       |-value: [0m[0;36mInt [0;1;36m8[0m[0m
[0;34m|       `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x57e0cae84860[0m <[0;33mcol:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 8[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae84ab8[0m <[0;33mline:649:5[0m, [0;33mcol:45[0m> [0;33mcol:13[0m referenced[0;1;36m _M_local_word[0m [0;32m'_Words[8]'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae84b28[0m <[0;33mline:652:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m referenced[0;1;36m _M_word_size[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae84bd0[0m <[0;33mline:653:5[0m, [0;33mcol:14[0m> [0;33mcol:14[0m referenced[0;1;36m _M_word[0m [0;32m'_Words *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae84e80[0m <[0;33mline:655:5[0m, [0;33mline:656:44[0m> [0;33mcol:5[0m used[0;1;36m _M_grow_words[0m [0;32m'_Words &(int, bool)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae84c40[0m <[0;33mcol:19[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __index[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae84cc0[0m <[0;33mcol:32[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m __iword[0m [0;32m'bool'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cae84f68[0m <[0;33mline:659:5[0m, [0;33mcol:13[0m> [0;33mcol:13[0m referenced[0;1;36m _M_ios_locale[0m [0;32m'locale':'std::locale'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae84fe8[0m <[0;33mline:661:5[0m, [0;33mline:662:21[0m> [0;33mcol:5[0m referenced[0;1;36m _M_init[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cae850b0[0m <[0;33mline:664:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cae850e0[0m <[0;33mline:670:5[0m, [0;33mline:685:5[0m> [0;33mline:670:11[0m class[0;1;36m Init[0m definition
[0;34m| |-[0m[0;1;32mDefinitionData[0m empty standard_layout has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided defaulted_is_constexpr
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m trivial user_declared has_const_param implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param user_declared implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m
[0;34m| | `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cae85220[0m <[0;33mcol:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m implicit referenced class[0;1;36m Init[0m
[0;34m| |-[0m[0;1;32mFriendDecl[0m[0;33m 0x57e0cae85328[0m <[0;33mline:672:7[0m, [0;33mcol:20[0m> [0;33mcol:14[0m [0;32m'class ios_base':'std::ios_base'[0m
[0;34m| |-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cae85378[0m <[0;33mline:673:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae85410[0m <[0;33mline:674:7[0m, [0;33mcol:12[0m> [0;33mcol:7[0m[0;1;36m Init[0m [0;32m'void ()'[0m
[0;34m| |-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x57e0cae85560[0m <[0;33mline:675:7[0m, [0;33mcol:13[0m> [0;33mcol:7[0m[0;1;36m ~Init[0m [0;32m'void ()'[0m noexcept-unevaluated 0x57e0cae85560
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae85818[0m <[0;33mline:678:7[0m, [0;33mcol:33[0m> [0;33mcol:7[0m constexpr[0;1;36m Init[0m [0;32m'void (const Init &)'[0m default trivial noexcept-unevaluated 0x57e0cae85818 implicit-inline
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae856f0[0m <[0;33mcol:12[0m, [0;33mcol:22[0m> [0;33mcol:23[0m [0;32m'const Init &'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae85ab0[0m <[0;33mline:679:7[0m, [0;33mcol:44[0m> [0;33mcol:13[0m[0;1;36m operator=[0m [0;32m'Init &(const Init &)'[0m default trivial noexcept-unevaluated 0x57e0cae85ab0 implicit-inline
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae85918[0m <[0;33mcol:23[0m, [0;33mcol:33[0m> [0;33mcol:34[0m [0;32m'const Init &'[0m
[0;34m| |-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cae85b80[0m <[0;33mline:682:5[0m, [0;33mcol:12[0m> [0;33mcol:5[0m private
[0;34m| |-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae85bc0[0m <[0;33mline:683:7[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m _S_refcount[0m [0;32m'_Atomic_word':'int'[0m static
[0;34m| `-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae85c58[0m <[0;33mline:684:7[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m _S_synced_with_stdio[0m [0;32m'bool'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae85e18[0m <[0;33mline:693:5[0m, [0;33mline:695:24[0m> [0;33mline:694:5[0m referenced[0;1;36m flags[0m [0;32m'fmtflags () const'[0m implicit-inline
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae89ef0[0m <[0;33mline:695:5[0m, [0;33mcol:24[0m>
[0;34m| | `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae89ee0[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m| |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae89ec8[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae89e98[0m <[0;33mcol:14[0m> [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x57e0cae83250[0m
[0;34m| |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae89e88[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cae85ec0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae86078[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ios_base.h:704:5[0m, [0;33mline:710:5[0m> [0;33mline:705:5[0m referenced[0;1;36m flags[0m [0;32m'fmtflags (fmtflags)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae85f50[0m <[0;33mcol:11[0m, [0;33mcol:20[0m> [0;33mcol:20[0m used[0;1;36m __fmtfl[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae8a138[0m <[0;33mline:706:5[0m, [0;33mline:710:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x57e0cae89ff8[0m <[0;33mline:707:7[0m, [0;33mcol:32[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae89f20[0m <[0;33mcol:7[0m, [0;33mcol:24[0m> [0;33mcol:16[0m used[0;1;36m __old[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae89fc8[0m <[0;33mcol:24[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae89f98[0m <[0;33mcol:24[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x57e0cae83250[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae89f88[0m <[0;33mcol:24[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cae8a0d0[0m <[0;33mline:708:7[0m, [0;33mcol:18[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '='
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8a068[0m <[0;33mcol:7[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x57e0cae83250[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8a058[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a0b8[0m <[0;33mcol:18[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8a098[0m <[0;33mcol:18[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae85f50[0m[0;1;36m '__fmtfl'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae8a128[0m <[0;33mline:709:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a110[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8a0f0[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cae89f20[0m[0;1;36m '__old'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae86218[0m <[0;33mline:720:5[0m, [0;33mline:726:5[0m> [0;33mline:721:5[0m used[0;1;36m setf[0m [0;32m'fmtflags (fmtflags)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae86168[0m <[0;33mcol:10[0m, [0;33mcol:19[0m> [0;33mcol:19[0m used[0;1;36m __fmtfl[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae8a448[0m <[0;33mline:722:5[0m, [0;33mline:726:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x57e0cae8a250[0m <[0;33mline:723:7[0m, [0;33mcol:32[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae8a178[0m <[0;33mcol:7[0m, [0;33mcol:24[0m> [0;33mcol:16[0m used[0;1;36m __old[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a220[0m <[0;33mcol:24[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8a1f0[0m <[0;33mcol:24[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x57e0cae83250[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8a1e0[0m <[0;33mcol:24[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x57e0cae8a3c8[0m <[0;33mline:724:7[0m, [0;33mcol:19[0m> [0;32m'const _Ios_Fmtflags':'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '|='
[0;34m|   | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a3b0[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(*)(_Ios_Fmtflags &, _Ios_Fmtflags) noexcept'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8a328[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags) noexcept'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x57e0cae783f8[0m[0;1;36m 'operator|='[0m [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags) noexcept'[0m
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8a2c0[0m <[0;33mcol:7[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x57e0cae83250[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8a2b0[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a310[0m <[0;33mcol:19[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8a2f0[0m <[0;33mcol:19[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae86168[0m[0;1;36m '__fmtfl'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae8a438[0m <[0;33mline:725:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a420[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8a400[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cae8a178[0m[0;1;36m '__old'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae864c8[0m <[0;33mline:737:5[0m, [0;33mline:744:5[0m> [0;33mline:738:5[0m used[0;1;36m setf[0m [0;32m'fmtflags (fmtflags, fmtflags)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae862f8[0m <[0;33mcol:10[0m, [0;33mcol:19[0m> [0;33mcol:19[0m used[0;1;36m __fmtfl[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae86378[0m <[0;33mcol:28[0m, [0;33mcol:37[0m> [0;33mcol:37[0m used[0;1;36m __mask[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae8a9b8[0m <[0;33mline:739:5[0m, [0;33mline:744:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x57e0cae8a560[0m <[0;33mline:740:7[0m, [0;33mcol:32[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae8a488[0m <[0;33mcol:7[0m, [0;33mcol:24[0m> [0;33mcol:16[0m used[0;1;36m __old[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a530[0m <[0;33mcol:24[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8a500[0m <[0;33mcol:24[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x57e0cae83250[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8a4f0[0m <[0;33mcol:24[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x57e0cae8a740[0m <[0;33mline:741:7[0m, [0;33mcol:20[0m> [0;32m'const _Ios_Fmtflags':'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '&='
[0;34m|   | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a728[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(*)(_Ios_Fmtflags &, _Ios_Fmtflags) noexcept'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8a708[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags) noexcept'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x57e0cae78850[0m[0;1;36m 'operator&='[0m [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags) noexcept'[0m
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8a5d0[0m <[0;33mcol:7[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x57e0cae83250[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8a5c0[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x57e0cae8a6d8[0m <[0;33mcol:19[0m, [0;33mcol:20[0m> [0;32m'_Ios_Fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m '~'
[0;34m|   |   |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a6c0[0m <[0;33mcol:19[0m> [0;32m'_Ios_Fmtflags (*)(_Ios_Fmtflags) noexcept'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   |   | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8a638[0m <[0;33mcol:19[0m> [0;32m'_Ios_Fmtflags (_Ios_Fmtflags) noexcept'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x57e0cae77ee0[0m[0;1;36m 'operator~'[0m [0;32m'_Ios_Fmtflags (_Ios_Fmtflags) noexcept'[0m
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a620[0m <[0;33mcol:20[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8a600[0m <[0;33mcol:20[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae86378[0m[0;1;36m '__mask'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x57e0cae8a938[0m <[0;33mline:742:7[0m, [0;33mcol:36[0m> [0;32m'const _Ios_Fmtflags':'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '|='
[0;34m|   | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a920[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(*)(_Ios_Fmtflags &, _Ios_Fmtflags) noexcept'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8a900[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags) noexcept'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x57e0cae783f8[0m[0;1;36m 'operator|='[0m [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags) noexcept'[0m
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8a7d0[0m <[0;33mcol:7[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x57e0cae83250[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8a7c0[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mParenExpr[0m[0;33m 0x57e0cae8a8e0[0m <[0;33mcol:19[0m, [0;33mcol:36[0m> [0;32m'_Ios_Fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m
[0;34m|   |   `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x57e0cae8a8a8[0m <[0;33mcol:20[0m, [0;33mcol:30[0m> [0;32m'_Ios_Fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m '&'
[0;34m|   |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a890[0m <[0;33mcol:28[0m> [0;32m'_Ios_Fmtflags (*)(_Ios_Fmtflags, _Ios_Fmtflags) noexcept'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   |     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8a870[0m <[0;33mcol:28[0m> [0;32m'_Ios_Fmtflags (_Ios_Fmtflags, _Ios_Fmtflags) noexcept'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x57e0cae771e0[0m[0;1;36m 'operator&'[0m [0;32m'_Ios_Fmtflags (_Ios_Fmtflags, _Ios_Fmtflags) noexcept'[0m
[0;34m|   |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a840[0m <[0;33mcol:20[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8a800[0m <[0;33mcol:20[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae862f8[0m[0;1;36m '__fmtfl'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   |     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a858[0m <[0;33mcol:30[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8a820[0m <[0;33mcol:30[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae86378[0m[0;1;36m '__mask'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae8a9a8[0m <[0;33mline:743:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8a990[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8a970[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cae8a488[0m[0;1;36m '__old'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae866e8[0m <[0;33mline:752:5[0m, [0;33mline:754:28[0m> [0;33mline:753:5[0m used[0;1;36m unsetf[0m [0;32m'void (fmtflags)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae865c0[0m <[0;33mcol:12[0m, [0;33mcol:21[0m> [0;33mcol:21[0m used[0;1;36m __mask[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae8ab80[0m <[0;33mline:754:5[0m, [0;33mcol:28[0m>
[0;34m|   `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x57e0cae8ab48[0m <[0;33mcol:7[0m, [0;33mcol:20[0m> [0;32m'const _Ios_Fmtflags':'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '&='
[0;34m|     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8ab30[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(*)(_Ios_Fmtflags &, _Ios_Fmtflags) noexcept'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8ab10[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags) noexcept'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x57e0cae78850[0m[0;1;36m 'operator&='[0m [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags) noexcept'[0m
[0;34m|     |-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8aa40[0m <[0;33mcol:7[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x57e0cae83250[0m
[0;34m|     | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8aa30[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x57e0cae8aae0[0m <[0;33mcol:19[0m, [0;33mcol:20[0m> [0;32m'_Ios_Fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m '~'
[0;34m|       |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8aac8[0m <[0;33mcol:19[0m> [0;32m'_Ios_Fmtflags (*)(_Ios_Fmtflags) noexcept'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|       | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8aaa8[0m <[0;33mcol:19[0m> [0;32m'_Ios_Fmtflags (_Ios_Fmtflags) noexcept'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x57e0cae77ee0[0m[0;1;36m 'operator~'[0m [0;32m'_Ios_Fmtflags (_Ios_Fmtflags) noexcept'[0m
[0;34m|       `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8aa90[0m <[0;33mcol:20[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|         `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8aa70[0m <[0;33mcol:20[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae865c0[0m[0;1;36m '__mask'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae86808[0m <[0;33mline:764:5[0m, [0;33mline:766:28[0m> [0;33mline:765:5[0m referenced[0;1;36m precision[0m [0;32m'streamsize () const'[0m implicit-inline
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae8ac00[0m <[0;33mline:766:5[0m, [0;33mcol:28[0m>
[0;34m| | `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae8abf0[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m| |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8abd8[0m <[0;33mcol:14[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8aba8[0m <[0;33mcol:14[0m> [0;32m'const streamsize':'const long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_precision[0;33m 0x57e0cae83180[0m
[0;34m| |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8ab98[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cae868b0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae86a28[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ios_base.h:773:5[0m, [0;33mline:779:5[0m> [0;33mline:774:5[0m[0;1;36m precision[0m [0;32m'streamsize (streamsize)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae86940[0m <[0;33mcol:15[0m, [0;33mcol:26[0m> [0;33mcol:26[0m used[0;1;36m __prec[0m [0;32m'streamsize':'long'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae8ae48[0m <[0;33mline:775:5[0m, [0;33mline:779:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x57e0cae8ad08[0m <[0;33mline:776:7[0m, [0;33mcol:38[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae8ac30[0m <[0;33mcol:7[0m, [0;33mcol:26[0m> [0;33mcol:18[0m used[0;1;36m __old[0m [0;32m'streamsize':'long'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8acd8[0m <[0;33mcol:26[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8aca8[0m <[0;33mcol:26[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_precision[0;33m 0x57e0cae83180[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8ac98[0m <[0;33mcol:26[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cae8ade0[0m <[0;33mline:777:7[0m, [0;33mcol:22[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m '='
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8ad78[0m <[0;33mcol:7[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_precision[0;33m 0x57e0cae83180[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8ad68[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8adc8[0m <[0;33mcol:22[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8ada8[0m <[0;33mcol:22[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae86940[0m[0;1;36m '__prec'[0m [0;32m'streamsize':'long'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae8ae38[0m <[0;33mline:778:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8ae20[0m <[0;33mcol:14[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8ae00[0m <[0;33mcol:14[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cae8ac30[0m[0;1;36m '__old'[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae86b28[0m <[0;33mline:788:5[0m, [0;33mline:790:24[0m> [0;33mline:789:5[0m referenced[0;1;36m width[0m [0;32m'streamsize () const'[0m implicit-inline
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae8aed8[0m <[0;33mline:790:5[0m, [0;33mcol:24[0m>
[0;34m| | `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae8aec8[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m| |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8aeb0[0m <[0;33mcol:14[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8ae80[0m <[0;33mcol:14[0m> [0;32m'const streamsize':'const long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_width[0;33m 0x57e0cae831e8[0m
[0;34m| |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8ae70[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cae86bd0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae86d10[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ios_base.h:797:5[0m, [0;33mline:803:5[0m> [0;33mline:798:5[0m referenced[0;1;36m width[0m [0;32m'streamsize (streamsize)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae86c60[0m <[0;33mcol:11[0m, [0;33mcol:22[0m> [0;33mcol:22[0m used[0;1;36m __wide[0m [0;32m'streamsize':'long'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae8b120[0m <[0;33mline:799:5[0m, [0;33mline:803:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x57e0cae8afe0[0m <[0;33mline:800:7[0m, [0;33mcol:34[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae8af08[0m <[0;33mcol:7[0m, [0;33mcol:26[0m> [0;33mcol:18[0m used[0;1;36m __old[0m [0;32m'streamsize':'long'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8afb0[0m <[0;33mcol:26[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8af80[0m <[0;33mcol:26[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_width[0;33m 0x57e0cae831e8[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8af70[0m <[0;33mcol:26[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cae8b0b8[0m <[0;33mline:801:7[0m, [0;33mcol:18[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m '='
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8b050[0m <[0;33mcol:7[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_width[0;33m 0x57e0cae831e8[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8b040[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8b0a0[0m <[0;33mcol:18[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8b080[0m <[0;33mcol:18[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae86c60[0m[0;1;36m '__wide'[0m [0;32m'streamsize':'long'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae8b110[0m <[0;33mline:802:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8b0f8[0m <[0;33mcol:14[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8b0d8[0m <[0;33mcol:14[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cae8af08[0m[0;1;36m '__old'[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae86ee8[0m <[0;33mline:816:5[0m, [0;33mline:817:39[0m> [0;33mcol:5[0m[0;1;36m sync_with_stdio[0m [0;32m'bool (bool)'[0m static
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae86e00[0m <[0;33mcol:21[0m, [0;33mcol:35[0m> [0;33mcol:26[0m[0;1;36m __sync[0m [0;32m'bool'[0m cinit
[0;34m|   `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x57e0cae89648[0m <[0;33mcol:35[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae870c0[0m <[0;33mline:828:5[0m, [0;33mline:829:38[0m> [0;33mcol:5[0m referenced[0;1;36m imbue[0m [0;32m'locale (const locale &) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae86fd0[0m <[0;33mcol:11[0m, [0;33mcol:25[0m> [0;33mcol:25[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae87218[0m <[0;33mline:840:5[0m, [0;33mline:842:29[0m> [0;33mline:841:5[0m referenced[0;1;36m getloc[0m [0;32m'locale () const'[0m implicit-inline
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae8b1c8[0m <[0;33mline:842:5[0m, [0;33mcol:29[0m>
[0;34m| | `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae8b1b8[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m| |   `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x57e0cae8b188[0m <[0;33mcol:14[0m> [0;32m'locale':'std::locale'[0m[0;36m[0m[0;36m[0m [0;32m'void (const locale &) throw()'[0m
[0;34m| |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8b158[0m <[0;33mcol:14[0m> [0;32m'const locale':'const std::locale'[0m[0;36m lvalue[0m[0;36m[0m ->_M_ios_locale[0;33m 0x57e0cae84f68[0m
[0;34m| |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8b148[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cae872c0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae873d0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ios_base.h:851:5[0m, [0;33mline:853:29[0m> [0;33mline:852:5[0m referenced[0;1;36m _M_getloc[0m [0;32m'const locale &() const'[0m implicit-inline
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae8b230[0m <[0;33mline:853:5[0m, [0;33mcol:29[0m>
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae8b220[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8b1f0[0m <[0;33mcol:14[0m> [0;32m'const locale':'const std::locale'[0m[0;36m lvalue[0m[0;36m[0m ->_M_ios_locale[0;33m 0x57e0cae84f68[0m
[0;34m|       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8b1e0[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae874f8[0m <[0;33mline:870:5[0m, [0;33mline:871:20[0m> [0;33mcol:5[0m[0;1;36m xalloc[0m [0;32m'int () throw()'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae876d0[0m <[0;33mline:886:5[0m, [0;33mline:892:5[0m> [0;33mline:887:5[0m[0;1;36m iword[0m [0;32m'long &(int)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae875d8[0m <[0;33mcol:11[0m, [0;33mcol:15[0m> [0;33mcol:15[0m used[0;1;36m __ix[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae8b7d8[0m <[0;33mline:888:5[0m, [0;33mline:892:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x57e0cae8b760[0m <[0;33mline:889:7[0m, [0;33mline:890:47[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae8b268[0m <[0;33mline:889:7[0m, [0;33mline:890:46[0m> [0;33mline:889:15[0m used[0;1;36m __word[0m [0;32m'_Words &'[0m cinit
[0;34m|   |   `-[0m[0;1;35mConditionalOperator[0m[0;33m 0x57e0cae8b6d0[0m <[0;33mcol:24[0m, [0;33mline:890:46[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |     |-[0m[0;1;35mParenExpr[0m[0;33m 0x57e0cae8b430[0m <[0;33mline:889:24[0m, [0;33mcol:64[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|   |     | `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cae8b410[0m <[0;33mcol:25[0m, [0;33mcol:52[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '<'
[0;34m|   |     |   |-[0m[0;1;35mCStyleCastExpr[0m[0;33m 0x57e0cae8b338[0m <[0;33mcol:25[0m, [0;33mcol:35[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |     |   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8b320[0m <[0;33mcol:35[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m> part_of_explicit_cast
[0;34m|   |     |   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8b308[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m> part_of_explicit_cast
[0;34m|   |     |   |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8b2d0[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae875d8[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |     |   `-[0m[0;1;35mCStyleCastExpr[0m[0;33m 0x57e0cae8b3e8[0m <[0;33mcol:42[0m, [0;33mcol:52[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |     |     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8b3d0[0m <[0;33mcol:52[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m> part_of_explicit_cast
[0;34m|   |     |       `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8b3b8[0m <[0;33mcol:52[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m> part_of_explicit_cast
[0;34m|   |     |         `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8b370[0m <[0;33mcol:52[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_word_size[0;33m 0x57e0cae84b28[0m
[0;34m|   |     |           `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8b360[0m <[0;33mcol:52[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |     |-[0m[0;1;35mArraySubscriptExpr[0m[0;33m 0x57e0cae8b4e0[0m <[0;33mline:890:6[0m, [0;33mcol:18[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |     | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8b4b0[0m <[0;33mcol:6[0m> [0;32m'_Words *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     | | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8b460[0m <[0;33mcol:6[0m> [0;32m'_Words *'[0m[0;36m lvalue[0m[0;36m[0m ->_M_word[0;33m 0x57e0cae84bd0[0m
[0;34m|   |     | |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8b450[0m <[0;33mcol:6[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |     | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8b4c8[0m <[0;33mcol:14[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8b490[0m <[0;33mcol:14[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae875d8[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |     `-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x57e0cae8b570[0m <[0;33mcol:22[0m, [0;33mcol:46[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |       |-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8b510[0m <[0;33mcol:22[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m ->_M_grow_words[0;33m 0x57e0cae84e80[0m
[0;34m|   |       | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8b500[0m <[0;33mcol:22[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |       |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8b5a0[0m <[0;33mcol:36[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8b540[0m <[0;33mcol:36[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae875d8[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |       `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x57e0cae8b560[0m <[0;33mcol:42[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae8b7c8[0m <[0;33mline:891:7[0m, [0;33mcol:21[0m>
[0;34m|     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8b798[0m <[0;33mcol:14[0m, [0;33mcol:21[0m> [0;32m'long'[0m[0;36m lvalue[0m[0;36m[0m ._M_iword[0;33m 0x57e0cae844a8[0m
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8b778[0m <[0;33mcol:14[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cae8b268[0m[0;1;36m '__word'[0m [0;32m'_Words &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae878e0[0m <[0;33mline:907:5[0m, [0;33mline:913:5[0m> [0;33mline:908:5[0m[0;1;36m pword[0m [0;32m'void *&(int)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae877b8[0m <[0;33mcol:11[0m, [0;33mcol:15[0m> [0;33mcol:15[0m used[0;1;36m __ix[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae8bc70[0m <[0;33mline:909:5[0m, [0;33mline:913:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x57e0cae8bbf8[0m <[0;33mline:910:7[0m, [0;33mline:911:48[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x57e0cae8b818[0m <[0;33mline:910:7[0m, [0;33mline:911:47[0m> [0;33mline:910:15[0m used[0;1;36m __word[0m [0;32m'_Words &'[0m cinit
[0;34m|   |   `-[0m[0;1;35mConditionalOperator[0m[0;33m 0x57e0cae8bb68[0m <[0;33mcol:24[0m, [0;33mline:911:47[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |     |-[0m[0;1;35mParenExpr[0m[0;33m 0x57e0cae8b9e0[0m <[0;33mline:910:24[0m, [0;33mcol:64[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|   |     | `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x57e0cae8b9c0[0m <[0;33mcol:25[0m, [0;33mcol:52[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '<'
[0;34m|   |     |   |-[0m[0;1;35mCStyleCastExpr[0m[0;33m 0x57e0cae8b8e8[0m <[0;33mcol:25[0m, [0;33mcol:35[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |     |   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8b8d0[0m <[0;33mcol:35[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m> part_of_explicit_cast
[0;34m|   |     |   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8b8b8[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m> part_of_explicit_cast
[0;34m|   |     |   |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8b880[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae877b8[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |     |   `-[0m[0;1;35mCStyleCastExpr[0m[0;33m 0x57e0cae8b998[0m <[0;33mcol:42[0m, [0;33mcol:52[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |     |     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8b980[0m <[0;33mcol:52[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m> part_of_explicit_cast
[0;34m|   |     |       `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8b968[0m <[0;33mcol:52[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m> part_of_explicit_cast
[0;34m|   |     |         `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8b920[0m <[0;33mcol:52[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_word_size[0;33m 0x57e0cae84b28[0m
[0;34m|   |     |           `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8b910[0m <[0;33mcol:52[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |     |-[0m[0;1;35mArraySubscriptExpr[0m[0;33m 0x57e0cae8ba90[0m <[0;33mline:911:6[0m, [0;33mcol:18[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |     | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8ba60[0m <[0;33mcol:6[0m> [0;32m'_Words *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     | | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8ba10[0m <[0;33mcol:6[0m> [0;32m'_Words *'[0m[0;36m lvalue[0m[0;36m[0m ->_M_word[0;33m 0x57e0cae84bd0[0m
[0;34m|   |     | |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8ba00[0m <[0;33mcol:6[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |     | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8ba78[0m <[0;33mcol:14[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8ba40[0m <[0;33mcol:14[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae877b8[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |     `-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x57e0cae8bb20[0m <[0;33mcol:22[0m, [0;33mcol:47[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |       |-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8bac0[0m <[0;33mcol:22[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m ->_M_grow_words[0;33m 0x57e0cae84e80[0m
[0;34m|   |       | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae8bab0[0m <[0;33mcol:22[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |       |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae8bb50[0m <[0;33mcol:36[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8baf0[0m <[0;33mcol:36[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0cae877b8[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |       `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x57e0cae8bb10[0m <[0;33mcol:42[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m false
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae8bc60[0m <[0;33mline:912:7[0m, [0;33mcol:21[0m>
[0;34m|     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae8bc30[0m <[0;33mcol:14[0m, [0;33mcol:21[0m> [0;32m'void *'[0m[0;36m lvalue[0m[0;36m[0m ._M_pword[0;33m 0x57e0cae84438[0m
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae8bc10[0m <[0;33mcol:14[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x57e0cae8b818[0m[0;1;36m '__word'[0m [0;32m'_Words &'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x57e0cae879f8[0m <[0;33mline:924:5[0m, [0;33mcol:23[0m> [0;33mcol:13[0m[0;1;36m ~ios_base[0m [0;32m'void () throw()'[0m virtual
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cae87b08[0m <[0;33mline:926:3[0m, [0;33mcol:12[0m> [0;33mcol:3[0m protected
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae87b78[0m <[0;33mline:927:5[0m, [0;33mcol:23[0m> [0;33mcol:5[0m referenced[0;1;36m ios_base[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cae87c48[0m <[0;33mline:938:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cae87e18[0m <[0;33mline:939:5[0m, [0;33mcol:38[0m> [0;33mcol:5[0m[0;1;36m ios_base[0m [0;32m'void (const ios_base &)'[0m delete implicit-inline
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae87cf0[0m <[0;33mcol:14[0m, [0;33mcol:28[0m> [0;33mcol:29[0m [0;32m'const ios_base &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae88050[0m <[0;33mline:941:5[0m, [0;33mline:942:39[0m> [0;33mcol:5[0m[0;1;36m operator=[0m [0;32m'ios_base &(const ios_base &)'[0m delete implicit-inline
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae87f18[0m <[0;33mcol:15[0m, [0;33mcol:29[0m> [0;33mcol:30[0m [0;32m'const ios_base &'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cae88120[0m <[0;33mline:944:3[0m, [0;33mcol:12[0m> [0;33mcol:3[0m protected
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae882a0[0m <[0;33mline:945:5[0m, [0;33mline:946:24[0m> [0;33mcol:5[0m referenced[0;1;36m _M_move[0m [0;32m'void (ios_base &) noexcept'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae88168[0m <[0;33mcol:13[0m, [0;33mcol:21[0m> [0;33mcol:22[0m [0;32m'ios_base &'[0m
[0;34m`-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cae88440[0m <[0;33mline:948:5[0m, [0;33mline:949:30[0m> [0;33mcol:5[0m referenced[0;1;36m _M_swap[0m [0;32m'void (ios_base &) noexcept'[0m
[0;34m  `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cae88388[0m <[0;33mcol:13[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __rhs[0m [0;32m'ios_base &'[0m

Layout: <CGRecordLayout
  LLVMType:%"class.std::ios_base" = type { ptr, i64, i64, i32, i32, i32, ptr, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, ptr, %"class.std::locale" }
  NonVirtualBaseLLVMType:%"class.std::ios_base" = type { ptr, i64, i64, i32, i32, i32, ptr, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, ptr, %"class.std::locale" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mClassTemplateSpecializationDecl[0m[0;33m 0x57e0c9c00d78[0m parent 0x57e0c9bf5da8 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.tcc:179:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m class[0;1;36m basic_ios[0m definition explicit_instantiation_declaration
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor has_mutable_fields can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m needs_overload_resolution
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m needs_overload_resolution
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared needs_overload_resolution
[0;34m|-[0mpublic [0;32m'ios_base':'std::ios_base'[0m
[0;34m|-[0mTemplateArgument type 'char'
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|-[0mTemplateArgument type 'std::char_traits<char>'
[0;34m| `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9b8fe70[0m [0;32m'std::char_traits<char>'[0m
[0;34m|   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9f61528[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cb0160a0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:69:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m implicit class[0;1;36m basic_ios[0m
[0;34m|-[0m[0;1;32mStaticAssertDecl[0m[0;33m 0x57e0cb016380[0m <[0;33mline:72:7[0m, [0;33mcol:67[0m> [0;33mcol:7[0m
[0;34m| |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cb016340[0m <[0;33mcol:21[0m, [0;33mcol:66[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cb0162c8[0m <[0;33mcol:21[0m, [0;33mcol:66[0m> [0;32m'const bool'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVarTemplateSpecialization[0m[0;33m 0x57e0ca573748[0m[0;1;36m 'is_same_v'[0m [0;32m'const bool'[0m ([0;1;32mVarTemplate[0m[0;33m 0x57e0c9dbe410[0m[0;1;36m 'is_same_v'[0m) non_odr_use_constant
[0;34m| `-[0m[0;34m<<<NULL>>>[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cb0163c8[0m <[0;33mline:75:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb016408[0m <[0;33mline:82:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m referenced[0;1;36m char_type[0m [0;32m'char'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb016150[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c00d78[0m[0;1;36m 'basic_ios'[0m
[0;34m|   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb0164d8[0m <[0;33mline:83:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m int_type[0m [0;32m'typename char_traits<char>::int_type':'int'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb016480[0m [0;32m'typename char_traits<char>::int_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9f66d60[0m [0;32m'std::char_traits<char>::int_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9f61800[0m[0;1;36m 'int_type'[0m
[0;34m|     `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad58c0[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb0165a8[0m <[0;33mline:84:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m pos_type[0m [0;32m'typename char_traits<char>::pos_type':'std::fpos<__mbstate_t>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb016550[0m [0;32m'typename char_traits<char>::pos_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x57e0caecc510[0m [0;32m'std::char_traits<char>::pos_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9f618a8[0m[0;1;36m 'pos_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9f61860[0m [0;32m'streampos'[0m sugar
[0;34m|       `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9f51df0[0m [0;32m'std::streampos'[0m sugar
[0;34m|         |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9bf57a8[0m[0;1;36m 'streampos'[0m
[0;34m|         `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bf5730[0m [0;32m'fpos<mbstate_t>'[0m sugar
[0;34m|           `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0c9bf56e0[0m [0;32m'fpos<mbstate_t>'[0m sugar
[0;34m|             |-name: [0m'fpos':'std::fpos' qualified
[0;34m|             | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0c9bef718[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/postypes.h:86:3[0m, [0;33mline:188:5[0m> [0;33mline:87:11[0m[0;1;36m fpos[0m
[0;34m|             |-[0mTemplateArgument type 'mbstate_t':'__mbstate_t'
[0;34m|             | `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bf4c00[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |   `-[0m[0;32mUsingType[0m[0;33m 0x57e0c9bf4bd0[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |     |-[0m[0;1;32mUsingShadow[0m[0;33m 0x57e0c9be7230[0m[0;1;36m 'mbstate_t'[0m
[0;34m|             |     `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9bc4de0[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |       |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9bb0848[0m[0;1;36m 'mbstate_t'[0m
[0;34m|             |       `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bb0800[0m [0;32m'__mbstate_t'[0m sugar
[0;34m|             |         `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9bb07d0[0m [0;32m'__mbstate_t'[0m sugar
[0;34m|             |           |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9bb0760[0m[0;1;36m '__mbstate_t'[0m
[0;34m|             |           `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bb0700[0m [0;32m'struct __mbstate_t'[0m sugar
[0;34m|             |             `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9b94950[0m [0;32m'__mbstate_t'[0m
[0;34m|             |               `-[0m[0;1;32mCXXRecord[0m[0;33m 0x57e0c9b948a0[0m[0;1;36m <[0;33m/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h:13:9[0m, [0;33mline:21:1[0m>[0m
[0;34m|             `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9bf56c0[0m [0;32m'std::fpos<__mbstate_t>'[0m
[0;34m|               `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9bf55c8[0m[0;1;36m 'fpos'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb016678[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:85:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m off_type[0m [0;32m'typename char_traits<char>::off_type':'long'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb016620[0m [0;32m'typename char_traits<char>::off_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x57e0caecc610[0m [0;32m'std::char_traits<char>::off_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9f61918[0m[0;1;36m 'off_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9befae0[0m [0;32m'streamoff'[0m sugar
[0;34m|       `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9befab0[0m [0;32m'std::streamoff'[0m sugar
[0;34m|         |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9bef480[0m[0;1;36m 'streamoff'[0m
[0;34m|         `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad58e0[0m [0;32m'long'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb0166e8[0m <[0;33mline:86:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m traits_type[0m [0;32m'std::char_traits<char>'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb016190[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c00d78[0m[0;1;36m 'basic_ios'[0m
[0;34m|   `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9b8fe70[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9f61528[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb01a308[0m <[0;33mline:93:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m referenced[0;1;36m __ctype_type[0m [0;32m'ctype<char>':'std::ctype<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb0167a0[0m [0;32m'ctype<char>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0cb016750[0m [0;32m'ctype<char>'[0m sugar
[0;34m|     |-name: [0m'ctype':'std::ctype' qualified
[0;34m|     | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0caf1e9b0[0m prev 0x57e0ca000158 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_facets.h:616:3[0m, [0;33mline:671:5[0m> [0;33mline:617:11[0m[0;1;36m ctype[0m
[0;34m|     |-[0mTemplateArgument type 'char'
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb016150[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c00d78[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x57e0ca0004c0[0m [0;32m'std::ctype<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0caf22080[0m[0;1;36m 'ctype'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb01a510[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:94:7[0m, [0;33mline:95:12[0m> [0;33mcol:12[0m referenced[0;1;36m __num_put_type[0m [0;32m'num_put<char, ostreambuf_iterator<char, char_traits<char>>>':'std::num_put<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb01a4b0[0m [0;32m'num_put<char, ostreambuf_iterator<char, char_traits<char>>>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0cb01a450[0m [0;32m'num_put<char, ostreambuf_iterator<char, char_traits<char>>>'[0m sugar
[0;34m|     |-name: [0m'num_put':'std::num_put' qualified
[0;34m|     | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0caf5eb98[0m prev 0x57e0ca002dc0 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_facets.h:2325:3[0m, [0;33mline:2600:5[0m> [0;33mline:2326:11[0m[0;1;36m num_put[0m
[0;34m|     |-[0mTemplateArgument type 'char'
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb016150[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c00d78[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|     |-[0mTemplateArgument type 'ostreambuf_iterator<char, char_traits<char>>':'std::ostreambuf_iterator<char>'
[0;34m|     | `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb01a3f0[0m [0;32m'ostreambuf_iterator<char, char_traits<char>>'[0m sugar
[0;34m|     |   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0cb01a390[0m [0;32m'ostreambuf_iterator<char, std::char_traits<char>>'[0m sugar
[0;34m|     |     |-name: [0m'ostreambuf_iterator':'std::ostreambuf_iterator' qualified
[0;34m|     |     | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0caf03308[0m prev 0x57e0ca30e128 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/streambuf_iterator.h:250:3[0m, [0;33mline:334:5[0m> [0;33mline:251:11[0m[0;1;36m ostreambuf_iterator[0m
[0;34m|     |     |-[0mTemplateArgument type 'char'
[0;34m|     |     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb016150[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c00d78[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|     |     |-[0mTemplateArgument type 'std::char_traits<char>'
[0;34m|     |     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb016190[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|     |     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c00d78[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |     |   `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9b8fe70[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     |     |     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9f61528[0m[0;1;36m 'char_traits'[0m
[0;34m|     |     `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadcc620[0m [0;32m'std::ostreambuf_iterator<char>'[0m
[0;34m|     |       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadcc518[0m[0;1;36m 'ostreambuf_iterator'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadcc7f0[0m [0;32m'std::num_put<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadcc6e8[0m[0;1;36m 'num_put'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb01a720[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:96:7[0m, [0;33mline:97:12[0m> [0;33mcol:12[0m referenced[0;1;36m __num_get_type[0m [0;32m'num_get<char, istreambuf_iterator<char, char_traits<char>>>':'std::num_get<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb01a6c0[0m [0;32m'num_get<char, istreambuf_iterator<char, char_traits<char>>>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0cb01a660[0m [0;32m'num_get<char, istreambuf_iterator<char, char_traits<char>>>'[0m sugar
[0;34m|     |-name: [0m'num_get':'std::num_get' qualified
[0;34m|     | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0caf51698[0m prev 0x57e0ca002740 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_facets.h:1961:3[0m, [0;33mline:2307:5[0m> [0;33mline:1962:11[0m[0;1;36m num_get[0m
[0;34m|     |-[0mTemplateArgument type 'char'
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb016150[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c00d78[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|     |-[0mTemplateArgument type 'istreambuf_iterator<char, char_traits<char>>':'std::istreambuf_iterator<char>'
[0;34m|     | `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb01a600[0m [0;32m'istreambuf_iterator<char, char_traits<char>>'[0m sugar
[0;34m|     |   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0cb01a5a0[0m [0;32m'istreambuf_iterator<char, std::char_traits<char>>'[0m sugar
[0;34m|     |     |-name: [0m'istreambuf_iterator':'std::istreambuf_iterator' qualified
[0;34m|     |     | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0caef28b8[0m prev 0x57e0ca30dee8 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/streambuf_iterator.h:55:3[0m, [0;33mline:231:5[0m> [0;33mline:56:11[0m[0;1;36m istreambuf_iterator[0m
[0;34m|     |     |-[0mTemplateArgument type 'char'
[0;34m|     |     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb016150[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c00d78[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|     |     |-[0mTemplateArgument type 'std::char_traits<char>'
[0;34m|     |     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb016190[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|     |     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c00d78[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |     |   `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9b8fe70[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     |     |     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9f61528[0m[0;1;36m 'char_traits'[0m
[0;34m|     |     `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadcc050[0m [0;32m'std::istreambuf_iterator<char>'[0m
[0;34m|     |       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadcbf48[0m[0;1;36m 'istreambuf_iterator'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadcc220[0m [0;32m'std::num_get<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadcc118[0m[0;1;36m 'num_get'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cb01a780[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:101:5[0m, [0;33mcol:14[0m> [0;33mcol:5[0m protected
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cb01a8f8[0m <[0;33mline:102:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_tie[0m [0;32m'basic_ostream<char, char_traits<char>> *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cb01a9c8[0m <[0;33mline:103:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_fill[0m [0;32m'char_type':'char'[0m mutable
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cb01aa20[0m <[0;33mline:104:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_fill_init[0m [0;32m'bool'[0m mutable
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cb01ab88[0m <[0;33mline:105:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_streambuf[0m [0;32m'basic_streambuf<char, char_traits<char>> *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cb01ac90[0m <[0;33mline:108:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_ctype[0m [0;32m'const __ctype_type *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cb01ad90[0m <[0;33mline:110:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_num_put[0m [0;32m'const __num_put_type *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cb01ae90[0m <[0;33mline:112:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_num_get[0m [0;32m'const __num_get_type *'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cb01aee8[0m <[0;33mline:114:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m|-[0m[0;1;32mCXXConversionDecl[0m[0;33m 0x57e0cb01af18[0m <[0;33mline:124:7[0m, [0;33mline:125:31[0m> [0;33mline:124:16[0m[0;1;36m operator bool[0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff5f58[0m
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cb01b010[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01b080[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:132:7[0m, [0;33mline:134:30[0m> [0;33mline:133:7[0m[0;1;36m operator![0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff60b0[0m
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cb01b138[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01b1a0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:145:7[0m, [0;33mline:147:36[0m> [0;33mline:146:7[0m[0;1;36m rdstate[0m [0;32m'iostate () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff6258[0m
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cb01b258[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01b358[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:156:7[0m, [0;33mline:157:38[0m> [0;33mcol:7[0m[0;1;36m clear[0m [0;32m'void (iostate)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0caff64f8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01b2c0[0m <[0;33mcol:13[0m, [0;33mcol:31[0m> [0;33mcol:21[0m[0;1;36m __state[0m [0;32m'iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01b4b8[0m <[0;33mline:165:7[0m, [0;33mline:167:49[0m> [0;33mline:166:7[0m[0;1;36m setstate[0m [0;32m'void (iostate)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff6688[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01b420[0m <[0;33mcol:16[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __state[0m [0;32m'iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01b618[0m <[0;33mline:172:7[0m, [0;33mline:180:7[0m> [0;33mline:173:7[0m[0;1;36m _M_setstate[0m [0;32m'void (iostate)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff6818[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01b580[0m <[0;33mcol:19[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m __state[0m [0;32m'iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01b6e0[0m <[0;33mline:189:7[0m, [0;33mline:191:38[0m> [0;33mline:190:7[0m[0;1;36m good[0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff6908[0m
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cb01b798[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01b800[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:200:7[0m, [0;33mline:202:49[0m> [0;33mline:201:7[0m[0;1;36m eof[0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff6a50[0m
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cb01b8b8[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01b920[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:212:7[0m, [0;33mline:214:61[0m> [0;33mline:213:7[0m[0;1;36m fail[0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff6b98[0m
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cb01b9d8[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01ba40[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:223:7[0m, [0;33mline:225:49[0m> [0;33mline:224:7[0m[0;1;36m bad[0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff6ce0[0m
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cb01baf8[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01bb60[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:235:7[0m, [0;33mline:237:30[0m> [0;33mline:236:7[0m[0;1;36m exceptions[0m [0;32m'iostate () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff6e28[0m
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cb01bc18[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01bd18[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:270:7[0m, [0;33mline:275:7[0m> [0;33mline:271:7[0m[0;1;36m exceptions[0m [0;32m'void (iostate)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff7010[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01bc80[0m <[0;33mcol:18[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __except[0m [0;32m'iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cb01c050[0m <[0;33mline:283:7[0m, [0;33mline:287:27[0m> [0;33mline:284:7[0m[0;1;36m basic_ios[0m [0;32m'void (basic_streambuf<char, char_traits<char>> *)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff7378[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01bf08[0m <[0;33mcol:17[0m, [0;33mcol:51[0m> [0;33mcol:51[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char, char_traits<char>> *'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x57e0cb01c148[0m <[0;33mline:295:7[0m, [0;33mline:296:22[0m> [0;33mcol:7[0m[0;1;36m ~basic_ios[0m [0;32m'void () throw()'[0m explicit_instantiation_declaration virtual implicit-inline instantiated_from[0;33m 0x57e0caff74d0[0m
[0;34m| `-[0mOverrides: [ 0x57e0cae879f8 ios_base::~ios_base 'void () throw()' ]
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01c408[0m <[0;33mline:309:7[0m, [0;33mline:311:24[0m> [0;33mline:310:7[0m[0;1;36m tie[0m [0;32m'basic_ostream<char, char_traits<char>> *() const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff7798[0m
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cb01c4c0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01c848[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:321:7[0m, [0;33mline:327:7[0m> [0;33mline:322:7[0m[0;1;36m tie[0m [0;32m'basic_ostream<char, char_traits<char>> *(basic_ostream<char, char_traits<char>> *)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff7c68[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01c718[0m <[0;33mcol:11[0m, [0;33mcol:43[0m> [0;33mcol:43[0m[0;1;36m __tiestr[0m [0;32m'basic_ostream<char, char_traits<char>> *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01caa8[0m <[0;33mline:336:7[0m, [0;33mline:338:30[0m> [0;33mline:337:7[0m[0;1;36m rdbuf[0m [0;32m'basic_streambuf<char, char_traits<char>> *() const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff7ef8[0m
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cb01cb60[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01cee8[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:362:7[0m, [0;33mline:363:51[0m> [0;33mcol:7[0m[0;1;36m rdbuf[0m [0;32m'basic_streambuf<char, char_traits<char>> *(basic_streambuf<char, char_traits<char>> *)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0caff83c8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01cdb8[0m <[0;33mcol:13[0m, [0;33mcol:47[0m> [0;33mcol:47[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char, char_traits<char>> *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01d1c0[0m <[0;33mline:376:7[0m, [0;33mline:377:37[0m> [0;33mcol:7[0m[0;1;36m copyfmt[0m [0;32m'basic_ios<char> &(const basic_ios<char> &)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0caff8680[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01d0a0[0m <[0;33mcol:15[0m, [0;33mcol:32[0m> [0;33mcol:32[0m[0;1;36m __rhs[0m [0;32m'const basic_ios<char> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01d2d8[0m <[0;33mline:386:7[0m, [0;33mline:392:7[0m> [0;33mline:387:7[0m[0;1;36m fill[0m [0;32m'char_type () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff87a8[0m
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0cb01d390[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01d518[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:403:7[0m, [0;33mline:410:7[0m> [0;33mline:404:7[0m[0;1;36m fill[0m [0;32m'char_type (char_type)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff89c8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01d408[0m <[0;33mcol:12[0m, [0;33mcol:22[0m> [0;33mcol:22[0m[0;1;36m __ch[0m [0;32m'char_type':'char'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01d688[0m <[0;33mline:424:7[0m, [0;33mline:425:32[0m> [0;33mcol:7[0m[0;1;36m imbue[0m [0;32m'locale (const locale &)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0caff8b70[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01d5f0[0m <[0;33mcol:13[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01d8b8[0m <[0;33mline:444:7[0m, [0;33mline:446:63[0m> [0;33mline:445:7[0m[0;1;36m narrow[0m [0;32m'char (char_type, char) const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff8de8[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01d760[0m <[0;33mcol:14[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __c[0m [0;32m'char_type':'char'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01d7d0[0m <[0;33mcol:29[0m, [0;33mcol:34[0m> [0;33mcol:34[0m[0;1;36m __dfault[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01da58[0m <[0;33mline:463:7[0m, [0;33mline:465:52[0m> [0;33mline:464:7[0m[0;1;36m widen[0m [0;32m'char_type (char) const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff8fb8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01d988[0m <[0;33mcol:13[0m, [0;33mcol:18[0m> [0;33mcol:18[0m[0;1;36m __c[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cb01db20[0m <[0;33mline:467:5[0m, [0;33mcol:14[0m> [0;33mcol:5[0m protected
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cb01db70[0m <[0;33mline:475:7[0m, [0;33mline:478:9[0m> [0;33mline:475:7[0m[0;1;36m basic_ios[0m [0;32m'void ()'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff90d8[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01de48[0m <[0;33mline:486:7[0m, [0;33mline:487:50[0m> [0;33mcol:7[0m[0;1;36m init[0m [0;32m'void (basic_streambuf<char, char_traits<char>> *)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0caff93e8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01dd78[0m <[0;33mcol:12[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char, char_traits<char>> *'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cb01e058[0m <[0;33mline:490:7[0m, [0;33mcol:42[0m> [0;33mcol:7[0m[0;1;36m basic_ios[0m [0;32m'void (const basic_ios<char> &)'[0m explicit_instantiation_declaration delete implicit-inline instantiated_from[0;33m 0x57e0caff95f8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01df28[0m <[0;33mcol:17[0m, [0;33mcol:32[0m> [0;33mcol:33[0m [0;32m'const basic_ios<char> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01e1f0[0m <[0;33mline:491:7[0m, [0;33mcol:53[0m> [0;33mcol:18[0m[0;1;36m operator=[0m [0;32m'basic_ios<char> &(const basic_ios<char> &)'[0m explicit_instantiation_declaration delete implicit-inline instantiated_from[0;33m 0x57e0caff97b0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01e150[0m <[0;33mcol:28[0m, [0;33mcol:43[0m> [0;33mcol:44[0m [0;32m'const basic_ios<char> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01e3e8[0m <[0;33mline:493:7[0m, [0;33mline:502:7[0m> [0;33mline:494:7[0m[0;1;36m move[0m [0;32m'void (basic_ios<char> &)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff99c8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01e2d0[0m <[0;33mcol:12[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __rhs[0m [0;32m'basic_ios<char> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01e648[0m <[0;33mline:504:7[0m, [0;33mline:506:28[0m> [0;33mline:505:7[0m[0;1;36m move[0m [0;32m'void (basic_ios<char> &&)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff9c38[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01e530[0m <[0;33mcol:12[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __rhs[0m [0;32m'basic_ios<char> &&'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01e850[0m <[0;33mline:508:7[0m, [0;33mline:517:7[0m> [0;33mline:509:7[0m[0;1;36m swap[0m [0;32m'void (basic_ios<char> &) noexcept'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caff9e60[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01e738[0m <[0;33mcol:12[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __rhs[0m [0;32m'basic_ios<char> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01eb18[0m <[0;33mline:519:7[0m, [0;33mline:521:30[0m> [0;33mline:520:7[0m[0;1;36m set_rdbuf[0m [0;32m'void (basic_streambuf<char, char_traits<char>> *)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0caffa168[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01ea48[0m <[0;33mcol:17[0m, [0;33mcol:51[0m> [0;33mcol:51[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char, char_traits<char>> *'[0m
[0;34m`-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb01ec78[0m <[0;33mline:524:7[0m, [0;33mline:525:42[0m> [0;33mcol:7[0m[0;1;36m _M_cache_locale[0m [0;32m'void (const locale &)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0caffa300[0m
[0;34m  `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb01ebe0[0m <[0;33mcol:23[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m

Layout: <CGRecordLayout
  LLVMType:%"class.std::basic_ios" = type { %"class.std::ios_base", ptr, i8, i8, ptr, ptr, ptr, ptr }
  NonVirtualBaseLLVMType:%"class.std::basic_ios" = type { %"class.std::ios_base", ptr, i8, i8, ptr, ptr, ptr, ptr }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mClassTemplateSpecializationDecl[0m[0;33m 0x57e0c9c016a8[0m parent 0x57e0c9bf5da8 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ostream.tcc:349:3[0m, [0;33mcol:43[0m> [0;33mcol:25[0m class[0;1;36m basic_ostream[0m definition explicit_instantiation_declaration
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor has_mutable_fields can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists non_trivial user_declared needs_overload_resolution
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists non_trivial user_declared needs_overload_resolution
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared needs_overload_resolution
[0;34m|-[0mvirtual public [0;32m'basic_ios<char, char_traits<char>>':'std::basic_ios<char>'[0m
[0;34m|-[0mTemplateArgument type 'char'
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|-[0mTemplateArgument type 'std::char_traits<char>'
[0;34m| `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9b8fe70[0m [0;32m'std::char_traits<char>'[0m
[0;34m|   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9f61528[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cb066958[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ostream.h:66:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m implicit class[0;1;36m basic_ostream[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cb066a08[0m <[0;33mline:68:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb066a48[0m <[0;33mline:70:7[0m, [0;33mcol:27[0m> [0;33mcol:27[0m referenced[0;1;36m char_type[0m [0;32m'char'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb0667d0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c016a8[0m[0;1;36m 'basic_ostream'[0m
[0;34m|   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb066b38[0m <[0;33mline:71:7[0m, [0;33mcol:44[0m> [0;33mcol:44[0m referenced[0;1;36m int_type[0m [0;32m'typename char_traits<char>::int_type':'int'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb066ae0[0m [0;32m'typename char_traits<char>::int_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9f66d60[0m [0;32m'std::char_traits<char>::int_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9f61800[0m[0;1;36m 'int_type'[0m
[0;34m|     `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad58c0[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb066c08[0m <[0;33mline:72:7[0m, [0;33mcol:44[0m> [0;33mcol:44[0m referenced[0;1;36m pos_type[0m [0;32m'typename char_traits<char>::pos_type':'std::fpos<__mbstate_t>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb066bb0[0m [0;32m'typename char_traits<char>::pos_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x57e0caecc510[0m [0;32m'std::char_traits<char>::pos_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9f618a8[0m[0;1;36m 'pos_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9f61860[0m [0;32m'streampos'[0m sugar
[0;34m|       `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9f51df0[0m [0;32m'std::streampos'[0m sugar
[0;34m|         |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9bf57a8[0m[0;1;36m 'streampos'[0m
[0;34m|         `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bf5730[0m [0;32m'fpos<mbstate_t>'[0m sugar
[0;34m|           `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0c9bf56e0[0m [0;32m'fpos<mbstate_t>'[0m sugar
[0;34m|             |-name: [0m'fpos':'std::fpos' qualified
[0;34m|             | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0c9bef718[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/postypes.h:86:3[0m, [0;33mline:188:5[0m> [0;33mline:87:11[0m[0;1;36m fpos[0m
[0;34m|             |-[0mTemplateArgument type 'mbstate_t':'__mbstate_t'
[0;34m|             | `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bf4c00[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |   `-[0m[0;32mUsingType[0m[0;33m 0x57e0c9bf4bd0[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |     |-[0m[0;1;32mUsingShadow[0m[0;33m 0x57e0c9be7230[0m[0;1;36m 'mbstate_t'[0m
[0;34m|             |     `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9bc4de0[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |       |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9bb0848[0m[0;1;36m 'mbstate_t'[0m
[0;34m|             |       `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bb0800[0m [0;32m'__mbstate_t'[0m sugar
[0;34m|             |         `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9bb07d0[0m [0;32m'__mbstate_t'[0m sugar
[0;34m|             |           |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9bb0760[0m[0;1;36m '__mbstate_t'[0m
[0;34m|             |           `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bb0700[0m [0;32m'struct __mbstate_t'[0m sugar
[0;34m|             |             `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9b94950[0m [0;32m'__mbstate_t'[0m
[0;34m|             |               `-[0m[0;1;32mCXXRecord[0m[0;33m 0x57e0c9b948a0[0m[0;1;36m <[0;33m/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h:13:9[0m, [0;33mline:21:1[0m>[0m
[0;34m|             `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9bf56c0[0m [0;32m'std::fpos<__mbstate_t>'[0m
[0;34m|               `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9bf55c8[0m[0;1;36m 'fpos'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb066cd8[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ostream.h:73:7[0m, [0;33mcol:44[0m> [0;33mcol:44[0m referenced[0;1;36m off_type[0m [0;32m'typename char_traits<char>::off_type':'long'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb066c80[0m [0;32m'typename char_traits<char>::off_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x57e0caecc610[0m [0;32m'std::char_traits<char>::off_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9f61918[0m[0;1;36m 'off_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9befae0[0m [0;32m'streamoff'[0m sugar
[0;34m|       `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9befab0[0m [0;32m'std::streamoff'[0m sugar
[0;34m|         |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9bef480[0m[0;1;36m 'streamoff'[0m
[0;34m|         `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad58e0[0m [0;32m'long'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb066d48[0m <[0;33mline:74:7[0m, [0;33mcol:28[0m> [0;33mcol:28[0m referenced[0;1;36m traits_type[0m [0;32m'std::char_traits<char>'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb066810[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c016a8[0m[0;1;36m 'basic_ostream'[0m
[0;34m|   `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9b8fe70[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9f61528[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb066e80[0m <[0;33mline:77:7[0m, [0;33mcol:50[0m> [0;33mcol:50[0m referenced[0;1;36m __streambuf_type[0m [0;32m'basic_streambuf<char, char_traits<char>>':'std::basic_streambuf<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb066e20[0m [0;32m'basic_streambuf<char, char_traits<char>>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0cb066dc0[0m [0;32m'basic_streambuf<char, std::char_traits<char>>'[0m sugar
[0;34m|     |-name: [0m'basic_streambuf':'std::basic_streambuf' qualified
[0;34m|     | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0cae92008[0m prev 0x57e0c9bf69d0 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/streambuf:125:3[0m, [0;33mline:832:5[0m> [0;33mline:126:11[0m[0;1;36m basic_streambuf[0m
[0;34m|     |-[0mTemplateArgument type 'char'
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb0667d0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c016a8[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|     |-[0mTemplateArgument type 'std::char_traits<char>'
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb066810[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c016a8[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9b8fe70[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     |     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9f61528[0m[0;1;36m 'char_traits'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9c01190[0m [0;32m'std::basic_streambuf<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c01088[0m[0;1;36m 'basic_streambuf'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb066fc0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ostream.h:78:7[0m, [0;33mcol:43[0m> [0;33mcol:43[0m referenced[0;1;36m __ios_type[0m [0;32m'basic_ios<char, char_traits<char>>':'std::basic_ios<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb066f60[0m [0;32m'basic_ios<char, char_traits<char>>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0cb066f00[0m [0;32m'basic_ios<char, std::char_traits<char>>'[0m sugar
[0;34m|     |-name: [0m'basic_ios':'std::basic_ios' qualified
[0;34m|     | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0caff4888[0m prev 0x57e0c9bf6230 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/basic_ios.h:68:3[0m, [0;33mline:526:5[0m> [0;33mline:69:11[0m[0;1;36m basic_ios[0m
[0;34m|     |-[0mTemplateArgument type 'char'
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb0667d0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c016a8[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|     |-[0mTemplateArgument type 'std::char_traits<char>'
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb066810[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c016a8[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9b8fe70[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     |     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9f61528[0m[0;1;36m 'char_traits'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9c00e80[0m [0;32m'std::basic_ios<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c00d78[0m[0;1;36m 'basic_ios'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb067100[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ostream.h:79:7[0m, [0;33mcol:47[0m> [0;33mcol:47[0m referenced[0;1;36m __ostream_type[0m [0;32m'basic_ostream<char, char_traits<char>>':'std::basic_ostream<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb0670a0[0m [0;32m'basic_ostream<char, char_traits<char>>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0cb067040[0m [0;32m'basic_ostream<char, std::char_traits<char>>'[0m sugar
[0;34m|     |-name: [0m'basic_ostream':'std::basic_ostream' qualified
[0;34m|     | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0cb0248b8[0m prev 0x57e0c9bf74b0 <[0;33mline:65:3[0m, [0;33mline:531:5[0m> [0;33mline:66:11[0m[0;1;36m basic_ostream[0m
[0;34m|     |-[0mTemplateArgument type 'char'
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb0667d0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c016a8[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|     |-[0mTemplateArgument type 'std::char_traits<char>'
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb066810[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c016a8[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9b8fe70[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     |     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9f61528[0m[0;1;36m 'char_traits'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9c017b0[0m [0;32m'std::basic_ostream<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c016a8[0m[0;1;36m 'basic_ostream'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb067310[0m <[0;33mline:80:7[0m, [0;33mline:81:8[0m> [0;33mcol:8[0m referenced[0;1;36m __num_put_type[0m [0;32m'num_put<char, ostreambuf_iterator<char, char_traits<char>>>':'std::num_put<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb0672b0[0m [0;32m'num_put<char, ostreambuf_iterator<char, char_traits<char>>>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0cb067250[0m [0;32m'num_put<char, ostreambuf_iterator<char, char_traits<char>>>'[0m sugar
[0;34m|     |-name: [0m'num_put':'std::num_put' qualified
[0;34m|     | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0caf5eb98[0m prev 0x57e0ca002dc0 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_facets.h:2325:3[0m, [0;33mline:2600:5[0m> [0;33mline:2326:11[0m[0;1;36m num_put[0m
[0;34m|     |-[0mTemplateArgument type 'char'
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb0667d0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c016a8[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|     |-[0mTemplateArgument type 'ostreambuf_iterator<char, char_traits<char>>':'std::ostreambuf_iterator<char>'
[0;34m|     | `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb0671f0[0m [0;32m'ostreambuf_iterator<char, char_traits<char>>'[0m sugar
[0;34m|     |   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0cb067190[0m [0;32m'ostreambuf_iterator<char, std::char_traits<char>>'[0m sugar
[0;34m|     |     |-name: [0m'ostreambuf_iterator':'std::ostreambuf_iterator' qualified
[0;34m|     |     | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0caf03308[0m prev 0x57e0ca30e128 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/streambuf_iterator.h:250:3[0m, [0;33mline:334:5[0m> [0;33mline:251:11[0m[0;1;36m ostreambuf_iterator[0m
[0;34m|     |     |-[0mTemplateArgument type 'char'
[0;34m|     |     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb0667d0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c016a8[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|     |     |-[0mTemplateArgument type 'std::char_traits<char>'
[0;34m|     |     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb066810[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|     |     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c016a8[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |     |   `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9b8fe70[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     |     |     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9f61528[0m[0;1;36m 'char_traits'[0m
[0;34m|     |     `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadcc620[0m [0;32m'std::ostreambuf_iterator<char>'[0m
[0;34m|     |       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadcc518[0m[0;1;36m 'ostreambuf_iterator'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x57e0cadcc7f0[0m [0;32m'std::num_put<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0cadcc6e8[0m[0;1;36m 'num_put'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0cb067428[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ostream.h:82:7[0m, [0;33mcol:38[0m> [0;33mcol:38[0m[0;1;36m __ctype_type[0m [0;32m'ctype<char>':'std::ctype<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0cb0673d0[0m [0;32m'ctype<char>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0cb067380[0m [0;32m'ctype<char>'[0m sugar
[0;34m|     |-name: [0m'ctype':'std::ctype' qualified
[0;34m|     | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0caf1e9b0[0m prev 0x57e0ca000158 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/locale_facets.h:616:3[0m, [0;33mline:671:5[0m> [0;33mline:617:11[0m[0;1;36m ctype[0m
[0;34m|     |-[0mTemplateArgument type 'char'
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0cb0667d0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9c016a8[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x57e0ca0004c0[0m [0;32m'std::ctype<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0caf22080[0m[0;1;36m 'ctype'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cb067640[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/ostream.h:91:7[0m, [0;33mline:93:27[0m> [0;33mline:92:7[0m[0;1;36m basic_ostream[0m [0;32m'void (__streambuf_type *)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb0258d8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb067530[0m <[0;33mcol:21[0m, [0;33mcol:39[0m> [0;33mcol:39[0m[0;1;36m __sb[0m [0;32m'__streambuf_type *'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x57e0cb067738[0m <[0;33mline:100:7[0m, [0;33mline:101:26[0m> [0;33mcol:7[0m[0;1;36m ~basic_ostream[0m [0;32m'void () throw()'[0m explicit_instantiation_declaration virtual implicit-inline instantiated_from[0;33m 0x57e0cb025a30[0m
[0;34m| `-[0mOverrides: [ 0x57e0cb01c148 basic_ios::~basic_ios 'void () throw()' ]
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cb067840[0m <[0;33mline:104:7[0m, [0;33mcol:13[0m> [0;33mcol:13[0m class[0;1;36m sentry[0m definition instantiated_from[0;33m 0x57e0cb025b08[0m
[0;34m| |-[0m[0;1;32mDefinitionData[0m has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m defaulted_is_constexpr
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param needs_implicit implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param needs_implicit implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m
[0;34m| | `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cb06cca8[0m <[0;33mline:541:5[0m, [0;33mcol:43[0m> [0;33mcol:43[0m implicit class[0;1;36m sentry[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cb06cd58[0m <[0;33mline:544:7[0m, [0;33mcol:16[0m> [0;33mcol:16[0m[0;1;36m _M_ok[0m [0;32m'bool'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cb06cec8[0m <[0;33mline:545:7[0m, [0;33mcol:40[0m> [0;33mcol:40[0m[0;1;36m _M_os[0m [0;32m'basic_ostream<char, char_traits<char>> &'[0m
[0;34m| |-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cb06cf20[0m <[0;33mline:547:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cb06d170[0m <[0;33mline:559:7[0m, [0;33mline:560:50[0m> [0;33mcol:7[0m[0;1;36m sentry[0m [0;32m'void (basic_ostream<char, char_traits<char>> &)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0cb034188[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06d068[0m <[0;33mcol:14[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __os[0m [0;32m'basic_ostream<char, char_traits<char>> &'[0m
[0;34m| |-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x57e0cb06d268[0m <[0;33mline:571:7[0m, [0;33mline:591:7[0m> [0;33mline:571:7[0m[0;1;36m ~sentry[0m [0;32m'void ()'[0m explicit_instantiation_declaration noexcept-unevaluated 0x57e0cb06d268 implicit-inline instantiated_from[0;33m 0x57e0cb0342e0[0m
[0;34m| `-[0m[0;1;32mCXXConversionDecl[0m[0;33m 0x57e0cb06d3a8[0m <[0;33mline:602:7[0m, [0;33mline:605:23[0m> [0;33mline:604:7[0m[0;1;36m operator bool[0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb034418[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x57e0cb067978[0m <[0;33mline:105:7[0m, [0;33mcol:20[0m> [0;33mcol:14[0m [0;32m'class sentry':'std::basic_ostream<char>::sentry'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb067d50[0m <[0;33mline:115:7[0m, [0;33mline:122:7[0m> [0;33mline:116:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(__ostream_type &(*)(__ostream_type &))'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb026060[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb067c38[0m <[0;33mcol:18[0m, [0;33mcol:57[0m> [0;33mcol:36[0m[0;1;36m __pf[0m [0;32m'__ostream_type &(*)(__ostream_type &)'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb0681a0[0m <[0;33mline:124:7[0m, [0;33mline:132:7[0m> [0;33mline:125:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(__ios_type &(*)(__ios_type &))'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb026520[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb068088[0m <[0;33mcol:18[0m, [0;33mcol:49[0m> [0;33mcol:32[0m[0;1;36m __pf[0m [0;32m'__ios_type &(*)(__ios_type &)'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb068390[0m <[0;33mline:134:7[0m, [0;33mline:142:7[0m> [0;33mline:135:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(ios_base &(*)(ios_base &))'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb0268b0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb068278[0m <[0;33mcol:18[0m, [0;33mcol:46[0m> [0;33mcol:30[0m[0;1;36m __pf[0m [0;32m'ios_base &(*)(ios_base &)'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb068580[0m <[0;33mline:173:7[0m, [0;33mline:175:32[0m> [0;33mline:174:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(long)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb026ae0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb068468[0m <[0;33mcol:18[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __n[0m [0;32m'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb068770[0m <[0;33mline:177:7[0m, [0;33mline:179:32[0m> [0;33mline:178:7[0m used[0;1;36m operator<<[0m [0;32m'__ostream_type &(unsigned long)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb026d10[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb068658[0m <[0;33mcol:18[0m, [0;33mcol:32[0m> [0;33mcol:32[0m[0;1;36m __n[0m [0;32m'unsigned long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb068960[0m <[0;33mline:181:7[0m, [0;33mline:183:32[0m> [0;33mline:182:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(bool)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb026f30[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb068848[0m <[0;33mcol:18[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __n[0m [0;32m'bool'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb068b50[0m <[0;33mline:185:7[0m, [0;33mline:186:27[0m> [0;33mcol:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(short)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0cb027160[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb068a38[0m <[0;33mcol:18[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __n[0m [0;32m'short'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb068d40[0m <[0;33mline:188:7[0m, [0;33mline:194:7[0m> [0;33mline:189:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(unsigned short)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb027390[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb068c28[0m <[0;33mcol:18[0m, [0;33mcol:33[0m> [0;33mcol:33[0m[0;1;36m __n[0m [0;32m'unsigned short'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb068f30[0m <[0;33mline:196:7[0m, [0;33mline:197:25[0m> [0;33mcol:7[0m used[0;1;36m operator<<[0m [0;32m'__ostream_type &(int)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0cb0275c0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb068e18[0m <[0;33mcol:18[0m, [0;33mcol:22[0m> [0;33mcol:22[0m[0;1;36m __n[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb069120[0m <[0;33mline:199:7[0m, [0;33mline:205:7[0m> [0;33mline:200:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(unsigned int)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb0277f0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb069008[0m <[0;33mcol:18[0m, [0;33mcol:31[0m> [0;33mcol:31[0m[0;1;36m __n[0m [0;32m'unsigned int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb069310[0m <[0;33mline:210:7[0m, [0;33mline:212:32[0m> [0;33mline:211:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(long long)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb027a20[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb0691f8[0m <[0;33mcol:18[0m, [0;33mcol:28[0m> [0;33mcol:28[0m[0;1;36m __n[0m [0;32m'long long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb069500[0m <[0;33mline:214:7[0m, [0;33mline:216:32[0m> [0;33mline:215:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(unsigned long long)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb027c50[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb0693e8[0m <[0;33mcol:18[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m __n[0m [0;32m'unsigned long long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb0696f0[0m <[0;33mline:230:7[0m, [0;33mline:232:32[0m> [0;33mline:231:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(double)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb027e80[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb0695d8[0m <[0;33mcol:18[0m, [0;33mcol:25[0m> [0;33mcol:25[0m[0;1;36m __f[0m [0;32m'double'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb0698e0[0m <[0;33mline:234:7[0m, [0;33mline:240:7[0m> [0;33mline:235:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(float)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb0280b0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb0697c8[0m <[0;33mcol:18[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __f[0m [0;32m'float'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb069ad0[0m <[0;33mline:242:7[0m, [0;33mline:244:32[0m> [0;33mline:243:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(long double)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb0282e0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb0699b8[0m <[0;33mcol:18[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m __f[0m [0;32m'long double'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb069cc0[0m <[0;33mline:300:7[0m, [0;33mline:302:32[0m> [0;33mline:301:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(const void *)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb028510[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb069ba8[0m <[0;33mcol:18[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m __p[0m [0;32m'const void *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb069eb0[0m <[0;33mline:305:7[0m, [0;33mline:307:36[0m> [0;33mline:306:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(nullptr_t)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb028730[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb069d98[0m <[0;33mcol:18[0m> [0;33mcol:27[0m [0;32m'nullptr_t':'std::nullptr_t'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06a0c0[0m <[0;33mline:338:7[0m, [0;33mline:339:40[0m> [0;33mcol:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(__streambuf_type *)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0cb028960[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb069fa0[0m <[0;33mcol:18[0m, [0;33mcol:36[0m> [0;33mcol:36[0m[0;1;36m __sb[0m [0;32m'__streambuf_type *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06a320[0m <[0;33mline:371:7[0m, [0;33mline:372:24[0m> [0;33mcol:7[0m[0;1;36m put[0m [0;32m'__ostream_type &(char_type)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0cb028bf0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06a208[0m <[0;33mcol:11[0m, [0;33mcol:21[0m> [0;33mcol:21[0m[0;1;36m __c[0m [0;32m'char_type':'char'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06a5d0[0m <[0;33mline:390:7[0m, [0;33mline:391:49[0m> [0;33mcol:7[0m[0;1;36m write[0m [0;32m'__ostream_type &(const char_type *, streamsize)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0cb028ef0[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06a430[0m <[0;33mcol:13[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m __s[0m [0;32m'const char_type *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06a4a0[0m <[0;33mcol:35[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __n[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06a730[0m <[0;33mline:403:7[0m, [0;33mline:404:13[0m> [0;33mcol:7[0m[0;1;36m flush[0m [0;32m'__ostream_type &()'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0cb029050[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06a8d8[0m <[0;33mline:413:7[0m, [0;33mline:414:13[0m> [0;33mcol:7[0m[0;1;36m tellp[0m [0;32m'pos_type ()'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0cb0291f8[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06aac0[0m <[0;33mline:424:7[0m, [0;33mline:425:21[0m> [0;33mcol:7[0m[0;1;36m seekp[0m [0;32m'__ostream_type &(pos_type)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0cb029400[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06a9a8[0m <[0;33mcol:13[0m> [0;33mcol:21[0m [0;32m'pos_type':'std::fpos<__mbstate_t>'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06ad90[0m <[0;33mline:436:8[0m, [0;33mline:437:40[0m> [0;33mcol:7[0m[0;1;36m seekp[0m [0;32m'__ostream_type &(off_type, ios_base::seekdir)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x57e0cb029770[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06abf8[0m <[0;33mcol:13[0m> [0;33mcol:21[0m [0;32m'off_type':'long'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06ac68[0m <[0;33mcol:23[0m, [0;33mcol:33[0m> [0;33mcol:40[0m [0;32m'ios_base::seekdir':'std::_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cb06ae70[0m <[0;33mline:439:5[0m, [0;33mcol:14[0m> [0;33mcol:5[0m protected
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cb06aec0[0m <[0;33mline:440:7[0m, [0;33mline:441:24[0m> [0;33mline:440:7[0m[0;1;36m basic_ostream[0m [0;32m'void ()'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb0298a8[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cb06b228[0m <[0;33mline:445:7[0m, [0;33mcol:57[0m> [0;33mcol:7[0m[0;1;36m basic_ostream[0m [0;32m'void (basic_iostream<char, char_traits<char>> &)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb029c28[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06b0f8[0m <[0;33mcol:21[0m, [0;33mcol:52[0m> [0;33mcol:53[0m [0;32m'basic_iostream<char, char_traits<char>> &'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cb06b4e8[0m <[0;33mline:447:7[0m, [0;33mcol:50[0m> [0;33mcol:7[0m[0;1;36m basic_ostream[0m [0;32m'void (const basic_ostream<char> &)'[0m explicit_instantiation_declaration delete implicit-inline instantiated_from[0;33m 0x57e0cb029eb8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06b3b0[0m <[0;33mcol:21[0m, [0;33mcol:40[0m> [0;33mcol:41[0m [0;32m'const basic_ostream<char> &'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cb06b778[0m <[0;33mline:449:7[0m, [0;33mline:451:34[0m> [0;33mline:449:7[0m[0;1;36m basic_ostream[0m [0;32m'void (basic_ostream<char> &&)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb02a148[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06b640[0m <[0;33mcol:21[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m __rhs[0m [0;32m'basic_ostream<char> &&'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06b9c0[0m <[0;33mline:455:7[0m, [0;33mcol:61[0m> [0;33mcol:22[0m[0;1;36m operator=[0m [0;32m'basic_ostream<char> &(const basic_ostream<char> &)'[0m explicit_instantiation_declaration delete implicit-inline instantiated_from[0;33m 0x57e0cb030440[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06b8a0[0m <[0;33mcol:32[0m, [0;33mcol:51[0m> [0;33mcol:52[0m [0;32m'const basic_ostream<char> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06bbc0[0m <[0;33mline:457:7[0m, [0;33mline:462:7[0m> [0;33mline:458:7[0m[0;1;36m operator=[0m [0;32m'basic_ostream<char> &(basic_ostream<char> &&)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb030660[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06baa0[0m <[0;33mcol:17[0m, [0;33mcol:33[0m> [0;33mcol:33[0m[0;1;36m __rhs[0m [0;32m'basic_ostream<char> &&'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06bdc8[0m <[0;33mline:464:7[0m, [0;33mline:466:34[0m> [0;33mline:465:7[0m[0;1;36m swap[0m [0;32m'void (basic_ostream<char> &)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb030888[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06bcb0[0m <[0;33mcol:12[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m __rhs[0m [0;32m'basic_ostream<char> &'[0m
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x57e0cb06c110[0m <[0;33mline:469:7[0m, [0;33mline:471:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0cb06be90[0m <[0;33mline:469:16[0m, [0;33mcol:25[0m> [0;33mcol:25[0m typename depth 0 index 0[0;1;36m _ValueT[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06c060[0m <[0;33mline:470:2[0m, [0;33mline:471:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(_ValueT)'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06bf48[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'_ValueT'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb0782e0[0m <[0;33mline:470:2[0m, [0;33mline:471:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(long)'[0m explicit_instantiation_declaration
[0;34m| | |-[0mTemplateArgument type 'long'
[0;34m| | | `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad58e0[0m [0;32m'long'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb078208[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'long'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb0786a0[0m <[0;33mline:470:2[0m, [0;33mline:471:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(unsigned long)'[0m explicit_instantiation_declaration
[0;34m| | |-[0mTemplateArgument type 'unsigned long'
[0;34m| | | `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5980[0m [0;32m'unsigned long'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb0785c8[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'unsigned long'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb078a40[0m <[0;33mline:470:2[0m, [0;33mline:471:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(bool)'[0m explicit_instantiation_declaration
[0;34m| | |-[0mTemplateArgument type 'bool'
[0;34m| | | `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5840[0m [0;32m'bool'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb078968[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'bool'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb078df0[0m <[0;33mline:470:2[0m, [0;33mline:471:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(long long)'[0m explicit_instantiation_declaration
[0;34m| | |-[0mTemplateArgument type 'long long'
[0;34m| | | `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5900[0m [0;32m'long long'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb078d18[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'long long'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb0791a0[0m <[0;33mline:470:2[0m, [0;33mline:471:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(unsigned long long)'[0m explicit_instantiation_declaration
[0;34m| | |-[0mTemplateArgument type 'unsigned long long'
[0;34m| | | `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad59a0[0m [0;32m'unsigned long long'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb0790c8[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'unsigned long long'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb079550[0m <[0;33mline:470:2[0m, [0;33mline:471:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(double)'[0m explicit_instantiation_declaration
[0;34m| | |-[0mTemplateArgument type 'double'
[0;34m| | | `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad59e0[0m [0;32m'double'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb079478[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'double'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb079900[0m <[0;33mline:470:2[0m, [0;33mline:471:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(long double)'[0m explicit_instantiation_declaration
[0;34m| | |-[0mTemplateArgument type 'long double'
[0;34m| | | `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5a00[0m [0;32m'long double'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb079828[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'long double'[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb079cb0[0m <[0;33mline:470:2[0m, [0;33mline:471:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(const void *)'[0m explicit_instantiation_declaration
[0;34m|   |-[0mTemplateArgument type 'const void *'
[0;34m|   | `-[0m[0;32mPointerType[0m[0;33m 0x57e0c9c2e790[0m [0;32m'const void *'[0m
[0;34m|   |   `-[0mQualType[0;33m 0x57e0c9ad5821[0m [0;32m'const void'[0m const
[0;34m|   |     `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5820[0m [0;32m'void'[0m
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb079bd8[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'const void *'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cb06c1e0[0m <[0;33mline:473:5[0m, [0;33mcol:12[0m> [0;33mcol:5[0m private
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06c3b8[0m <[0;33mline:475:7[0m, [0;33mline:477:49[0m> [0;33mline:476:7[0m[0;1;36m _M_write[0m [0;32m'void (const char_type *, streamsize)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb030e98[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06c228[0m <[0;33mcol:16[0m, [0;33mcol:33[0m> [0;33mcol:33[0m[0;1;36m __s[0m [0;32m'const char_type *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06c298[0m <[0;33mcol:38[0m, [0;33mcol:49[0m> [0;33mcol:49[0m[0;1;36m __n[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x57e0cb06c7a8[0m <[0;33mline:482:7[0m, [0;33mline:508:2[0m> [0;33mline:484:2[0m[0;1;36m _S_cast_flt[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0cb06c488[0m <[0;33mline:482:16[0m, [0;33mcol:25[0m> [0;33mcol:25[0m typename depth 0 index 0[0;1;36m _To[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0cb06c518[0m <[0;33mcol:30[0m, [0;33mcol:39[0m> [0;33mcol:39[0m typename depth 0 index 1[0;1;36m _From[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06c6f8[0m <[0;33mline:483:2[0m, [0;33mline:508:2[0m> [0;33mline:484:2[0m[0;1;36m _S_cast_flt[0m [0;32m'_To (_From)'[0m static implicit-inline
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06c5e0[0m <[0;33mcol:14[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __f[0m [0;32m'_From'[0m
[0;34m`-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cb06c878[0m <[0;33mline:512:7[0m, [0;33mcol:14[0m> [0;33mcol:14[0m struct[0;1;36m _Disable_exceptions[0m definition instantiated_from[0;33m 0x57e0cb031318[0m
[0;34m  |-[0m[0;1;32mDefinitionData[0m has_user_declared_ctor can_const_default_init
[0;34m  | |-[0m[0;1;32mDefaultConstructor[0m defaulted_is_constexpr
[0;34m  | |-[0m[0;1;32mCopyConstructor[0m trivial user_declared has_const_param implicit_has_const_param
[0;34m  | |-[0m[0;1;32mMoveConstructor[0m
[0;34m  | |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param user_declared implicit_has_const_param
[0;34m  | |-[0m[0;1;32mMoveAssignment[0m
[0;34m  | `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m  |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0cb06d528[0m <[0;33mcol:7[0m, [0;33mcol:14[0m> [0;33mcol:14[0m implicit struct[0;1;36m _Disable_exceptions[0m
[0;34m  |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cb06d6c0[0m <[0;33mline:514:2[0m, [0;33mline:516:44[0m> [0;33mline:514:2[0m[0;1;36m _Disable_exceptions[0m [0;32m'void (basic_ostream<char> &)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0cb031610[0m
[0;34m  | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06d5f0[0m <[0;33mcol:22[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m __os[0m [0;32m'basic_ostream<char> &'[0m
[0;34m  |-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x57e0cb06d7b8[0m <[0;33mline:518:2[0m, [0;33mline:519:39[0m> [0;33mline:518:2[0m[0;1;36m ~_Disable_exceptions[0m [0;32m'void ()'[0m explicit_instantiation_declaration noexcept-unevaluated 0x57e0cb06d7b8 implicit-inline instantiated_from[0;33m 0x57e0cb031760[0m
[0;34m  |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0cb06daa8[0m <[0;33mline:523:2[0m, [0;33mcol:57[0m> [0;33mcol:2[0m[0;1;36m _Disable_exceptions[0m [0;32m'void (const _Disable_exceptions &)'[0m explicit_instantiation_declaration delete trivial implicit-inline instantiated_from[0;33m 0x57e0cb0319d8[0m
[0;34m  | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06d970[0m <[0;33mcol:22[0m, [0;33mcol:47[0m> [0;33mcol:48[0m [0;32m'const _Disable_exceptions &'[0m
[0;34m  |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0cb06dd20[0m <[0;33mline:524:2[0m, [0;33mcol:68[0m> [0;33mcol:23[0m[0;1;36m operator=[0m [0;32m'_Disable_exceptions &(const _Disable_exceptions &)'[0m explicit_instantiation_declaration delete trivial implicit-inline instantiated_from[0;33m 0x57e0cb031c70[0m
[0;34m  | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0cb06dc00[0m <[0;33mcol:33[0m, [0;33mcol:58[0m> [0;33mcol:59[0m [0;32m'const _Disable_exceptions &'[0m
[0;34m  |-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0cb06dde8[0m <[0;33mline:527:7[0m, [0;33mcol:14[0m> [0;33mcol:7[0m private
[0;34m  |-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cb06de30[0m <[0;33mline:528:2[0m, [0;33mcol:17[0m> [0;33mcol:17[0m[0;1;36m _M_os[0m [0;32m'basic_ostream<char> &'[0m
[0;34m  `-[0m[0;1;32mFieldDecl[0m[0;33m 0x57e0cb06de88[0m <[0;33mline:529:2[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m _M_exception[0m [0;32m'const ios_base::iostate':'const std::_Ios_Iostate'[0m

Layout: <CGRecordLayout
  LLVMType:%"class.std::basic_ostream" = type { ptr, %"class.std::basic_ios" }
  NonVirtualBaseLLVMType:%"class.std::basic_ostream.base" = type { ptr }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mClassTemplateSpecializationDecl[0m[0;33m 0x57e0ca0dd338[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/new_allocator.h:62:3[0m, [0;33mline:238:5[0m> [0;33mline:63:11[0m class[0;1;36m __new_allocator[0m definition implicit_instantiation
[0;34m|-[0m[0;1;32mDefinitionData[0m empty standard_layout literal has_user_declared_ctor has_constexpr_non_copy_move_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided constexpr defaulted_is_constexpr
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m
[0;34m| |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param user_declared implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m
[0;34m| `-[0m[0;1;32mDestructor[0m simple irrelevant trivial constexpr needs_implicit
[0;34m|-[0mTemplateArgument type 'char'
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0ca0dd600[0m <[0;33mcol:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m implicit class[0;1;36m __new_allocator[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0ca0dd6b0[0m <[0;33mline:65:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0ca0dd728[0m <[0;33mline:66:7[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m value_type[0m [0;32m'char'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0ca0dd6e0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _Tp[0m
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0ca0dd338[0m[0;1;36m '__new_allocator'[0m
[0;34m|   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0ca0dd788[0m <[0;33mline:67:7[0m, [0;33mcol:31[0m> [0;33mcol:31[0m referenced[0;1;36m size_type[0m [0;32m'std::size_t':'unsigned long'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0ca0cf1b0[0m [0;32m'std::size_t'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9becff0[0m [0;32m'std::size_t'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9b2fec0[0m[0;1;36m 'size_t'[0m
[0;34m|     `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5980[0m [0;32m'unsigned long'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0ca0dd7e8[0m <[0;33mline:68:7[0m, [0;33mcol:31[0m> [0;33mcol:31[0m[0;1;36m difference_type[0m [0;32m'std::ptrdiff_t':'long'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0ca0cf290[0m [0;32m'std::ptrdiff_t'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9bef4e0[0m [0;32m'std::ptrdiff_t'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9b2ff38[0m[0;1;36m 'ptrdiff_t'[0m
[0;34m|     `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad58e0[0m [0;32m'long'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0ca0dd848[0m <[0;33mline:83:7[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m propagate_on_container_move_assignment[0m [0;32m'std::true_type':'std::integral_constant<bool, true>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0ca0cf370[0m [0;32m'std::true_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9c74260[0m [0;32m'std::true_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypeAlias[0m[0;33m 0x57e0c9bf9ee8[0m[0;1;36m 'true_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bf9e70[0m [0;32m'__bool_constant<true>'[0m sugar
[0;34m|       `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0c9bf9e20[0m [0;32m'__bool_constant<true>'[0m sugar alias
[0;34m|         |-name: [0m'__bool_constant':'std::__bool_constant' qualified
[0;34m|         | `-[0m[0;1;32mTypeAliasTemplateDecl[0m[0;33m 0x57e0c9bf9ac0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/type_traits:111:3[0m, [0;33mline:112:56[0m> [0;33mcol:5[0m[0;1;36m __bool_constant[0m
[0;34m|         |-[0mTemplateArgument expr 'true'
[0;34m|         | `-[0m[0;1;35mConstantExpr[0m[0;33m 0x57e0c9bf9b58[0m <[0;33mline:116:38[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|         |   |-value: [0m[0;36mInt [0;1;36m1[0m[0m
[0;34m|         |   `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x57e0c9bf9b30[0m <[0;33mcol:38[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m|         `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bf9dc0[0m [0;32m'integral_constant<bool, true>'[0m sugar
[0;34m|           `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0c9bf9d60[0m [0;32m'integral_constant<bool, true>'[0m sugar
[0;34m|             |-name: [0m'integral_constant':'std::integral_constant' qualified
[0;34m|             | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0c9c66f60[0m <[0;33mline:91:3[0m, [0;33mline:102:5[0m> [0;33mline:92:12[0m[0;1;36m integral_constant[0m
[0;34m|             |-[0mTemplateArgument type 'bool'
[0;34m|             | `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5840[0m [0;32m'bool'[0m
[0;34m|             |-[0mTemplateArgument expr 'true'
[0;34m|             | `-[0m[0;1;35mConstantExpr[0m[0;33m 0x57e0c9bf9c08[0m <[0;33mline:112:53[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|             |   |-value: [0m[0;36mInt [0;1;36m1[0m[0m
[0;34m|             |   `-[0m[0;1;35mSubstNonTypeTemplateParmExpr[0m[0;33m 0x57e0c9bf9bc0[0m <[0;33mcol:53[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|             |     |-[0m[0;1;32mNonTypeTemplateParmDecl[0m[0;33m 0x57e0c9bf9840[0m <[0;33mline:111:12[0m, [0;33mcol:17[0m> [0;33mcol:17[0m referenced [0;32m'bool'[0m depth 0 index 0[0;1;36m __v[0m
[0;34m|             |     `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x57e0c9bf9bb0[0m <[0;33mline:112:53[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m|             `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9bf9d40[0m [0;32m'std::integral_constant<bool, true>'[0m
[0;34m|               `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9bf9c30[0m[0;1;36m 'integral_constant'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0ca0dd8e0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/new_allocator.h:86:7[0m, [0;33mline:88:49[0m> [0;33mcol:7[0m used constexpr[0;1;36m __new_allocator[0m [0;32m'void () noexcept'[0m implicit_instantiation implicit-inline instantiated_from[0;33m 0x57e0ca0cf4b8[0m
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0ca0d0fc0[0m <[0;33mcol:47[0m, [0;33mcol:49[0m>
[0;34m| `-[0m[0;1;34mAlwaysInlineAttr[0m[0;33m 0x57e0ca0dd9f0[0m <[0;33mline:86:22[0m> always_inline
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0ca0de478[0m <[0;33mline:90:7[0m, [0;33mline:92:71[0m> [0;33mcol:7[0m used constexpr[0;1;36m __new_allocator[0m [0;32m'void (const __new_allocator<char> &) noexcept'[0m implicit_instantiation implicit-inline instantiated_from[0;33m 0x57e0ca0cf7c0[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca0ddb00[0m <[0;33mcol:23[0m, [0;33mcol:44[0m> [0;33mcol:45[0m [0;32m'const __new_allocator<char> &'[0m
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0ca0d0fd0[0m <[0;33mcol:69[0m, [0;33mcol:71[0m>
[0;34m| `-[0m[0;1;34mAlwaysInlineAttr[0m[0;33m 0x57e0ca0de558[0m <[0;33mline:90:22[0m> always_inline
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x57e0ca0de988[0m <[0;33mline:94:7[0m, [0;33mline:97:72[0m> [0;33mcol:2[0m[0;1;36m __new_allocator[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0ca0de5c8[0m <[0;33mline:94:16[0m, [0;33mcol:25[0m> [0;33mcol:25[0m typename depth 0 index 0[0;1;36m _Tp1[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0ca0de8d0[0m <[0;33mline:95:2[0m, [0;33mline:97:72[0m> [0;33mcol:2[0m constexpr[0;1;36m __new_allocator[0m [0;32m'void (const __new_allocator<_Tp1> &) noexcept'[0m implicit-inline
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca0de790[0m <[0;33mcol:18[0m, [0;33mcol:45[0m> [0;33mcol:46[0m [0;32m'const __new_allocator<_Tp1> &'[0m
[0;34m| | `-[0m[0;1;34mAlwaysInlineAttr[0m[0;33m 0x57e0ca0dea00[0m <[0;33mline:95:17[0m> always_inline
[0;34m| `-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0caa22b70[0m <[0;33mcol:2[0m, [0;33mline:97:72[0m> [0;33mcol:2[0m constexpr[0;1;36m __new_allocator[0m [0;32m'void (const __new_allocator<char> &) noexcept'[0m implicit_instantiation implicit-inline
[0;34m|   |-[0mTemplateArgument type 'char'
[0;34m|   | `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0caa22a90[0m <[0;33mcol:18[0m, [0;33mcol:45[0m> [0;33mcol:46[0m [0;32m'const __new_allocator<char> &'[0m
[0;34m|   `-[0m[0;1;34mAlwaysInlineAttr[0m[0;33m 0x57e0caa22c90[0m <[0;33mline:95:17[0m> always_inline
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0ca0dec70[0m <[0;33mline:100:7[0m, [0;33mcol:66[0m> [0;33mcol:24[0m constexpr[0;1;36m operator=[0m [0;32m'__new_allocator<char> &(const __new_allocator<char> &)'[0m implicit_instantiation default trivial noexcept-unevaluated 0x57e0ca0dec70 implicit-inline instantiated_from[0;33m 0x57e0ca0cffb0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca0deb50[0m <[0;33mcol:34[0m, [0;33mcol:55[0m> [0;33mcol:56[0m [0;32m'const __new_allocator<char> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0ca0deef8[0m <[0;33mline:125:26[0m, [0;33mline:152:7[0m> [0;33mline:126:7[0m used[0;1;36m allocate[0m [0;32m'char *(size_type, const void *)'[0m implicit_instantiation implicit-inline instantiated_from[0;33m 0x57e0ca0d0308[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca0ded68[0m <[0;33mcol:16[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __n[0m [0;32m'size_type':'unsigned long'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca0dedd8[0m <[0;33mcol:31[0m, [0;33mcol:71[0m> [0;33mcol:43[0m [0;32m'const void *'[0m
[0;34m| `-[0m[0;1;34mWarnUnusedResultAttr[0m[0;33m 0x57e0ca0defc0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:173:31[0m> nodiscard ""
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0ca0df228[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/new_allocator.h:155:7[0m, [0;33mline:173:7[0m> [0;33mline:156:7[0m used[0;1;36m deallocate[0m [0;32m'void (char *, size_type)'[0m implicit_instantiation implicit-inline instantiated_from[0;33m 0x57e0ca0d0678[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca0df038[0m <[0;33mcol:18[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __p[0m [0;32m'char *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca0df0a8[0m <[0;33mcol:28[0m, [0;33mcol:38[0m> [0;33mcol:38[0m[0;1;36m __n[0m [0;32m'size_type':'unsigned long'[0m
[0;34m|   `-[0m[0;1;34mUnusedAttr[0m[0;33m 0x57e0ca0df110[0m <[0;33mcol:58[0m> unused
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x57e0ca0df878[0m <[0;33mline:213:7[0m, [0;33mline:217:17[0m> [0;33mline:215:2[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x57e0ca0df720[0m parent 0x57e0ca0ceb60 <[0;33mline:213:7[0m, [0;33mline:217:17[0m> [0;33mline:215:2[0m friend_undeclared[0;1;36m operator==[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0ca0df2f8[0m <[0;33mline:213:16[0m, [0;33mcol:25[0m> [0;33mcol:25[0m typename depth 0 index 0[0;1;36m _Up[0m
[0;34m|   `-[0m[0;1;32mFunctionDecl[0m[0;33m 0x57e0ca0df650[0m parent 0x57e0ca0ceb60 <[0;33mline:214:2[0m, [0;33mline:217:17[0m> [0;33mline:215:2[0m constexpr friend_undeclared[0;1;36m operator==[0m [0;32m'bool (const __new_allocator<char> &, const __new_allocator<_Up> &) noexcept'[0m implicit-inline
[0;34m|     |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca0df3c0[0m <[0;33mcol:13[0m, [0;33mcol:34[0m> [0;33mcol:35[0m [0;32m'const __new_allocator<char> &'[0m
[0;34m|     |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca0df520[0m <[0;33mcol:37[0m, [0;33mcol:63[0m> [0;33mcol:64[0m [0;32m'const __new_allocator<_Up> &'[0m
[0;34m|     `-[0m[0;1;34mAlwaysInlineAttr[0m[0;33m 0x57e0ca0df808[0m <[0;33mline:214:24[0m> always_inline
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0ca0df8c8[0m <[0;33mline:227:5[0m, [0;33mcol:12[0m> [0;33mcol:5[0m private
[0;34m`-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0ca0df8f8[0m <[0;33mline:228:7[0m, [0;33mline:237:7[0m> [0;33mline:230:7[0m constexpr[0;1;36m _M_max_size[0m [0;32m'size_type () const noexcept'[0m implicit_instantiation implicit-inline instantiated_from[0;33m 0x57e0ca0d0e10[0m
[0;34m  `-[0m[0;1;34mAlwaysInlineAttr[0m[0;33m 0x57e0ca0df9c8[0m <[0;33mline:228:22[0m> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__new_allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__new_allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mClassTemplateSpecializationDecl[0m[0;33m 0x57e0c9b91ba8[0m parent 0x57e0c9b5bf38 <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/allocator.h:292:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m class[0;1;36m allocator[0m definition explicit_instantiation_declaration
[0;34m|-[0m[0;1;32mDefinitionData[0m empty standard_layout literal has_user_declared_ctor has_constexpr_non_copy_move_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided constexpr defaulted_is_constexpr
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m needs_overload_resolution
[0;34m| |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m needs_overload_resolution
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared constexpr
[0;34m|-[0mpublic [0;32m'__allocator_base<char>':'std::__new_allocator<char>'[0m
[0;34m|-[0mTemplateArgument type 'char'
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x57e0ca0dfae8[0m <[0;33mline:133:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m implicit class[0;1;36m allocator[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x57e0ca0dfb98[0m <[0;33mline:135:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0ca0dfbd8[0m <[0;33mline:136:7[0m, [0;33mcol:26[0m> [0;33mcol:26[0m referenced[0;1;36m value_type[0m [0;32m'char'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x57e0ca0dd2b0[0m [0;32m'char'[0m sugar typename depth 0 index 0
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9b91ba8[0m[0;1;36m 'allocator'[0m
[0;34m|   `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0ca0dfc38[0m <[0;33mline:137:7[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m size_type[0m [0;32m'size_t':'unsigned long'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bed020[0m [0;32m'size_t'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9becff0[0m [0;32m'std::size_t'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9b2fec0[0m[0;1;36m 'size_t'[0m
[0;34m|     `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5980[0m [0;32m'unsigned long'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x57e0ca0dfc98[0m <[0;33mline:138:7[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m difference_type[0m [0;32m'ptrdiff_t':'long'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bef510[0m [0;32m'ptrdiff_t'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9bef4e0[0m [0;32m'std::ptrdiff_t'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x57e0c9b2ff38[0m[0;1;36m 'ptrdiff_t'[0m
[0;34m|     `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad58e0[0m [0;32m'long'[0m
[0;34m|-[0m[0;1;32mTypeAliasDecl[0m[0;33m 0x57e0ca0dfcf8[0m <[0;33mline:155:7[0m, [0;33mcol:54[0m> [0;33mcol:13[0m[0;1;36m propagate_on_container_move_assignment[0m [0;32m'true_type':'std::integral_constant<bool, true>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9c74290[0m [0;32m'true_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9c74260[0m [0;32m'std::true_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypeAlias[0m[0;33m 0x57e0c9bf9ee8[0m[0;1;36m 'true_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bf9e70[0m [0;32m'__bool_constant<true>'[0m sugar
[0;34m|       `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0c9bf9e20[0m [0;32m'__bool_constant<true>'[0m sugar alias
[0;34m|         |-name: [0m'__bool_constant':'std::__bool_constant' qualified
[0;34m|         | `-[0m[0;1;32mTypeAliasTemplateDecl[0m[0;33m 0x57e0c9bf9ac0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/type_traits:111:3[0m, [0;33mline:112:56[0m> [0;33mcol:5[0m[0;1;36m __bool_constant[0m
[0;34m|         |-[0mTemplateArgument expr 'true'
[0;34m|         | `-[0m[0;1;35mConstantExpr[0m[0;33m 0x57e0c9bf9b58[0m <[0;33mline:116:38[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|         |   |-value: [0m[0;36mInt [0;1;36m1[0m[0m
[0;34m|         |   `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x57e0c9bf9b30[0m <[0;33mcol:38[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m|         `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bf9dc0[0m [0;32m'integral_constant<bool, true>'[0m sugar
[0;34m|           `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0c9bf9d60[0m [0;32m'integral_constant<bool, true>'[0m sugar
[0;34m|             |-name: [0m'integral_constant':'std::integral_constant' qualified
[0;34m|             | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0c9c66f60[0m <[0;33mline:91:3[0m, [0;33mline:102:5[0m> [0;33mline:92:12[0m[0;1;36m integral_constant[0m
[0;34m|             |-[0mTemplateArgument type 'bool'
[0;34m|             | `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5840[0m [0;32m'bool'[0m
[0;34m|             |-[0mTemplateArgument expr 'true'
[0;34m|             | `-[0m[0;1;35mConstantExpr[0m[0;33m 0x57e0c9bf9c08[0m <[0;33mline:112:53[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|             |   |-value: [0m[0;36mInt [0;1;36m1[0m[0m
[0;34m|             |   `-[0m[0;1;35mSubstNonTypeTemplateParmExpr[0m[0;33m 0x57e0c9bf9bc0[0m <[0;33mcol:53[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|             |     |-[0m[0;1;32mNonTypeTemplateParmDecl[0m[0;33m 0x57e0c9bf9840[0m <[0;33mline:111:12[0m, [0;33mcol:17[0m> [0;33mcol:17[0m referenced [0;32m'bool'[0m depth 0 index 0[0;1;36m __v[0m
[0;34m|             |     `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x57e0c9bf9bb0[0m <[0;33mline:112:53[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m|             `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9bf9d40[0m [0;32m'std::integral_constant<bool, true>'[0m
[0;34m|               `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9bf9c30[0m[0;1;36m 'integral_constant'[0m
[0;34m|-[0m[0;1;32mTypeAliasDecl[0m[0;33m 0x57e0ca0dfd60[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/allocator.h:158:7[0m, [0;33mline:160:4[0m> [0;33mline:158:13[0m[0;1;36m is_always_equal[0m [0;32m'true_type':'std::integral_constant<bool, true>'[0m
[0;34m| |-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9c74290[0m [0;32m'true_type'[0m sugar
[0;34m| | `-[0m[0;32mTypedefType[0m[0;33m 0x57e0c9c74260[0m [0;32m'std::true_type'[0m sugar
[0;34m| |   |-[0m[0;1;32mTypeAlias[0m[0;33m 0x57e0c9bf9ee8[0m[0;1;36m 'true_type'[0m
[0;34m| |   `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bf9e70[0m [0;32m'__bool_constant<true>'[0m sugar
[0;34m| |     `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0c9bf9e20[0m [0;32m'__bool_constant<true>'[0m sugar alias
[0;34m| |       |-name: [0m'__bool_constant':'std::__bool_constant' qualified
[0;34m| |       | `-[0m[0;1;32mTypeAliasTemplateDecl[0m[0;33m 0x57e0c9bf9ac0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/type_traits:111:3[0m, [0;33mline:112:56[0m> [0;33mcol:5[0m[0;1;36m __bool_constant[0m
[0;34m| |       |-[0mTemplateArgument expr 'true'
[0;34m| |       | `-[0m[0;1;35mConstantExpr[0m[0;33m 0x57e0c9bf9b58[0m <[0;33mline:116:38[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m| |       |   |-value: [0m[0;36mInt [0;1;36m1[0m[0m
[0;34m| |       |   `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x57e0c9bf9b30[0m <[0;33mcol:38[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m| |       `-[0m[0;32mElaboratedType[0m[0;33m 0x57e0c9bf9dc0[0m [0;32m'integral_constant<bool, true>'[0m sugar
[0;34m| |         `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x57e0c9bf9d60[0m [0;32m'integral_constant<bool, true>'[0m sugar
[0;34m| |           |-name: [0m'integral_constant':'std::integral_constant' qualified
[0;34m| |           | `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x57e0c9c66f60[0m <[0;33mline:91:3[0m, [0;33mline:102:5[0m> [0;33mline:92:12[0m[0;1;36m integral_constant[0m
[0;34m| |           |-[0mTemplateArgument type 'bool'
[0;34m| |           | `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5840[0m [0;32m'bool'[0m
[0;34m| |           |-[0mTemplateArgument expr 'true'
[0;34m| |           | `-[0m[0;1;35mConstantExpr[0m[0;33m 0x57e0c9bf9c08[0m <[0;33mline:112:53[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m| |           |   |-value: [0m[0;36mInt [0;1;36m1[0m[0m
[0;34m| |           |   `-[0m[0;1;35mSubstNonTypeTemplateParmExpr[0m[0;33m 0x57e0c9bf9bc0[0m <[0;33mcol:53[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m| |           |     |-[0m[0;1;32mNonTypeTemplateParmDecl[0m[0;33m 0x57e0c9bf9840[0m <[0;33mline:111:12[0m, [0;33mcol:17[0m> [0;33mcol:17[0m referenced [0;32m'bool'[0m depth 0 index 0[0;1;36m __v[0m
[0;34m| |           |     `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x57e0c9bf9bb0[0m <[0;33mline:112:53[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m| |           `-[0m[0;32mRecordType[0m[0;33m 0x57e0c9bf9d40[0m [0;32m'std::integral_constant<bool, true>'[0m
[0;34m| |             `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x57e0c9bf9c30[0m[0;1;36m 'integral_constant'[0m
[0;34m| `-[0m[0;1;34mDeprecatedAttr[0m[0;33m 0x57e0ca0dfdc0[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/x86_64-linux-gnu/c++/15/bits/c++config.h:112:19[0m, [0;33mcol:58[0m> "use 'std::allocator_traits::is_always_equal' instead" ""
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0ca0dfea8[0m <[0;33m/usr/lib/gcc/x86_64-linux-gnu/15/../../../../include/c++/15/bits/allocator.h:166:7[0m, [0;33mline:168:38[0m> [0;33mcol:7[0m used constexpr[0;1;36m allocator[0m [0;32m'void () noexcept'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0ca0d7a08[0m
[0;34m| |-[0mCXXCtorInitializer [0;32m'__allocator_base<char>':'std::__new_allocator<char>'[0m
[0;34m| | `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x57e0caa219e0[0m <[0;33mcol:7[0m> [0;32m'__allocator_base<char>':'std::__new_allocator<char>'[0m[0;36m[0m[0;36m[0m [0;32m'void () noexcept'[0m
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0ca0d9088[0m <[0;33mcol:36[0m, [0;33mcol:38[0m>
[0;34m| `-[0m[0;1;34mAlwaysInlineAttr[0m[0;33m 0x57e0ca0dffb0[0m <[0;33mline:166:22[0m> always_inline
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0ca0e0200[0m <[0;33mline:170:7[0m, [0;33mline:173:38[0m> [0;33mline:172:7[0m used constexpr[0;1;36m allocator[0m [0;32m'void (const allocator<char> &) noexcept'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0ca0d7d10[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca0e00c0[0m <[0;33mcol:17[0m, [0;33mcol:34[0m> [0;33mcol:34[0m used[0;1;36m __a[0m [0;32m'const allocator<char> &'[0m
[0;34m| |-[0mCXXCtorInitializer [0;32m'__allocator_base<char>':'std::__new_allocator<char>'[0m
[0;34m| | `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x57e0caa22d08[0m <[0;33mline:173:9[0m, [0;33mcol:34[0m> [0;32m'__allocator_base<char>':'std::__new_allocator<char>'[0m[0;36m[0m[0;36m[0m [0;32m'void (const __new_allocator<char> &) noexcept'[0m
[0;34m| |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0caa22ce8[0m <[0;33mcol:31[0m> [0;32m'const __new_allocator<char>':'const std::__new_allocator<char>'[0m[0;36m lvalue[0m[0;36m[0m <[0;31mDerivedToBase[0m (__new_allocator)>
[0;34m| |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0caa22748[0m <[0;33mcol:31[0m> [0;32m'const allocator<char>':'const std::allocator<char>'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0ca0e00c0[0m[0;1;36m '__a'[0m [0;32m'const allocator<char> &'[0m
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0ca0d9298[0m <[0;33mcol:36[0m, [0;33mcol:38[0m>
[0;34m| `-[0m[0;1;34mAlwaysInlineAttr[0m[0;33m 0x57e0ca0e02e0[0m <[0;33mline:170:22[0m> always_inline
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0ca0e04f0[0m <[0;33mline:177:7[0m, [0;33mcol:54[0m> [0;33mcol:18[0m constexpr[0;1;36m operator=[0m [0;32m'allocator<char> &(const allocator<char> &)'[0m explicit_instantiation_declaration default trivial noexcept-unevaluated 0x57e0ca0e04f0 implicit-inline instantiated_from[0;33m 0x57e0ca0d8000[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca0e03d0[0m <[0;33mcol:28[0m, [0;33mcol:43[0m> [0;33mcol:44[0m [0;32m'const allocator<char> &'[0m
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x57e0ca0e0908[0m <[0;33mline:180:7[0m, [0;33mline:183:55[0m> [0;33mcol:2[0m[0;1;36m allocator[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x57e0ca0e05b8[0m <[0;33mline:180:16[0m, [0;33mcol:25[0m> [0;33mcol:25[0m typename depth 0 index 0[0;1;36m _Tp1[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0ca0e0850[0m <[0;33mline:181:2[0m, [0;33mline:183:55[0m> [0;33mcol:2[0m constexpr[0;1;36m allocator[0m [0;32m'void (const allocator<_Tp1> &) noexcept'[0m implicit-inline
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca0e0750[0m <[0;33mcol:12[0m, [0;33mcol:33[0m> [0;33mcol:34[0m [0;32m'const allocator<_Tp1> &'[0m
[0;34m| | `-[0m[0;1;34mAlwaysInlineAttr[0m[0;33m 0x57e0ca0e0980[0m <[0;33mline:181:17[0m> always_inline
[0;34m| `-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x57e0ca9cc8c0[0m <[0;33mcol:2[0m, [0;33mline:183:55[0m> [0;33mcol:2[0m constexpr[0;1;36m allocator[0m [0;32m'void (const allocator<char> &) noexcept'[0m implicit_instantiation implicit-inline
[0;34m|   |-[0mTemplateArgument type 'char'
[0;34m|   | `-[0m[0;32mBuiltinType[0m[0;33m 0x57e0c9ad5860[0m [0;32m'char'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca9cc7e0[0m <[0;33mcol:12[0m, [0;33mcol:33[0m> [0;33mcol:34[0m [0;32m'const allocator<char> &'[0m
[0;34m|   `-[0m[0;1;34mAlwaysInlineAttr[0m[0;33m 0x57e0ca9cc9e0[0m <[0;33mline:181:17[0m> always_inline
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x57e0ca0e0a80[0m <[0;33mline:185:7[0m, [0;33mline:189:39[0m> [0;33mcol:7[0m used constexpr[0;1;36m ~allocator[0m [0;32m'void () noexcept'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0ca0d8640[0m
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0ca0d92b8[0m <[0;33mcol:37[0m, [0;33mcol:39[0m>
[0;34m| `-[0m[0;1;34mAlwaysInlineAttr[0m[0;33m 0x57e0ca0e0b60[0m <[0;33mline:185:22[0m> always_inline
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x57e0ca0e0d08[0m <[0;33mline:193:7[0m, [0;33mline:204:7[0m> [0;33mline:194:7[0m used constexpr[0;1;36m allocate[0m [0;32m'char *(size_t)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x57e0ca0d88d8[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x57e0ca0e0bf8[0m <[0;33mcol:16[0m, [0;33mcol:23[0m> [0;33mcol:23[0m used[0;1;36m __n[0m [0;32m'size_t':'unsigned long'[0m
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae44520[0m <[0;33mline:195:7[0m, [0;33mline:204:7[0m>
[0;34m| | |-[0m[0;1;35mIfStmt[0m[0;33m 0x57e0cae44240[0m <[0;33mline:196:2[0m, [0;33mline:201:4[0m>
[0;34m| | | |-[0m[0;1;35mCallExpr[0m[0;33m 0x57e0cae43fd8[0m <[0;33mline:196:6[0m, [0;33mcol:35[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m| | | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae43fc0[0m <[0;33mcol:6[0m, [0;33mcol:11[0m> [0;32m'bool (*)() noexcept'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m| | | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0ca0d9c30[0m <[0;33mcol:6[0m, [0;33mcol:11[0m> [0;32m'bool () noexcept'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x57e0c9b30960[0m[0;1;36m '__is_constant_evaluated'[0m [0;32m'bool () noexcept'[0m
[0;34m| | | |     `-[0mNestedNameSpecifier [0;1;32mNamespace[0m[0;33m 0x57e0ca0d6258[0m[0;1;36m 'std'[0m
[0;34m| | | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x57e0cae44220[0m <[0;33mline:197:4[0m, [0;33mline:201:4[0m>
[0;34m| | |   |-[0m[0;1;35mIfStmt[0m[0;33m 0x57e0cae44138[0m <[0;33mline:198:6[0m, [0;33mline:199:42[0m>
[0;34m| | |   | |-[0m[0;1;35mCallExpr[0m[0;33m 0x57e0cae440b0[0m <[0;33mline:198:10[0m, [0;33mcol:55[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m| | |   | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae44098[0m <[0;33mcol:10[0m> [0;32m'bool (*)(...) noexcept'[0m[0;36m[0m[0;36m[0m <[0;31mBuiltinFnToFnPtr[0m>
[0;34m| | |   | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0ca0d9e60[0m <[0;33mcol:10[0m> [0;32m'<builtin fn type>'[0m[0;36m[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x57e0ca0d9d38[0m[0;1;36m '__builtin_mul_overflow'[0m [0;32m'bool (...) noexcept'[0m
[0;34m| | |   | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae440e8[0m <[0;33mcol:33[0m> [0;32m'size_t':'unsigned long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | |   | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae43ff8[0m <[0;33mcol:33[0m> [0;32m'size_t':'unsigned long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0ca0e0bf8[0m[0;1;36m '__n'[0m [0;32m'size_t':'unsigned long'[0m
[0;34m| | |   | | |-[0m[0;1;35mUnaryExprOrTypeTraitExpr[0m[0;33m 0x57e0cae44040[0m <[0;33mcol:38[0m, [0;33mcol:48[0m> [0;32m'unsigned long'[0m[0;36m[0m[0;36m[0m sizeof [0;32m'char'[0m
[0;34m| | |   | | `-[0m[0;1;35mUnaryOperator[0m[0;33m 0x57e0cae44080[0m <[0;33mcol:51[0m, [0;33mcol:52[0m> [0;32m'size_t *'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m| | |   | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae44060[0m <[0;33mcol:52[0m> [0;32m'size_t':'unsigned long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0ca0e0bf8[0m[0;1;36m '__n'[0m [0;32m'size_t':'unsigned long'[0m
[0;34m| | |   | `-[0m[0;1;35mCallExpr[0m[0;33m 0x57e0cae44118[0m <[0;33mline:199:8[0m, [0;33mcol:42[0m> [0;32m'void'[0m[0;36m[0m[0;36m[0m
[0;34m| | |   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae44100[0m <[0;33mcol:8[0m, [0;33mcol:13[0m> [0;32m'void (*)() __attribute__((noreturn))'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m| | |   |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0ca0da0a8[0m <[0;33mcol:8[0m, [0;33mcol:13[0m> [0;32m'void () __attribute__((noreturn))'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x57e0ca0c3a08[0m[0;1;36m '__throw_bad_array_new_length'[0m [0;32m'void () __attribute__((noreturn))'[0m
[0;34m| | |   |       `-[0mNestedNameSpecifier [0;1;32mNamespace[0m[0;33m 0x57e0ca0d6258[0m[0;1;36m 'std'[0m
[0;34m| | |   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae44210[0m <[0;33mline:200:6[0m, [0;33mcol:50[0m>
[0;34m| | |     `-[0m[0;1;35mCXXStaticCastExpr[0m[0;33m 0x57e0cae441e0[0m <[0;33mcol:13[0m, [0;33mcol:50[0m> [0;32m'char *'[0m[0;36m[0m[0;36m[0m static_cast<char *> <BitCast>
[0;34m| | |       `-[0m[0;1;35mCallExpr[0m[0;33m 0x57e0cae441a0[0m <[0;33mcol:31[0m, [0;33mcol:49[0m> [0;32m'void *'[0m[0;36m[0m[0;36m[0m
[0;34m| | |         |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae44188[0m <[0;33mcol:31[0m, [0;33mcol:42[0m> [0;32m'void *(*)(std::size_t)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m| | |         | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0ca0da1d8[0m <[0;33mcol:31[0m, [0;33mcol:42[0m> [0;32m'void *(std::size_t)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x57e0c9be0f90[0m[0;1;36m 'operator new'[0m [0;32m'void *(std::size_t)'[0m
[0;34m| | |         |   `-[0mNestedNameSpecifier Global
[0;34m| | |         `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae441c8[0m <[0;33mcol:46[0m> [0;32m'size_t':'unsigned long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | |           `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x57e0cae44168[0m <[0;33mcol:46[0m> [0;32m'size_t':'unsigned long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x57e0ca0e0bf8[0m[0;1;36m '__n'[0m [0;32m'size_t':'unsigned long'[0m
[0;34m| | `-[0m[0;1;35mReturnStmt[0m[0;33m 0x57e0cae44510[0m <[0;33mline:203:2[0m, [0;33mcol:47[0m>
[0;34m| |   `-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x57e0cae444b0[0m <[0;33mcol:9[0m, [0;33mcol:47[0m> [0;32m'char *'[0m[0;36m[0m[0;36m[0m
[0;34m| |     |-[0m[0;1;35mMemberExpr[0m[0;33m 0x57e0cae443f8[0m <[0;33mcol:9[0m, [0;33mcol:32[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m ->allocate[0;33m 0x57e0ca0deef8[0m
[0;34m| |     | |-[0mNestedNameSpecifier TypeSpec [0;32m'__allocator_base<char>':'std::__new_allocator<char>'[0m
[0;34m| |     | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae44490[0m <[0;33mcol:32[0m> [0;32m'__allocator_base<char> *'[0m[0;36m[0m[0;36m[0m <[0;31mUncheckedDerivedToBase[0m (__new_allocator)>
[0;34m| |     |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x57e0cae443e8[0m <[0;33mcol:32[0m> [0;32m'std::allocator<char> *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x57e0cae444e0[0m <[0;33mcol:41[0m> [0;32m'size_t':'unsigned long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
